[
    {
        "title_en": "The Virtues Of Dhikr",
        "title_id": "Keutamaan Dzikir",
        "type": "note",
        "contents": [
            {
                "pre_text_id": "Allah ﷻ berfirman:",
                "post_text_id": null,
                "text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
                "translation_id": "Karena itu, ingatlah kamu kepada-Ku niscaya Aku ingat (pula) kepadamu (dengan memberikan rahmat dan pengampunan). Dan bersyukurlah kepada-Ku, serta jangan ingkar (pada nikmat-Ku).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. Al-Baqarah: 152)",
                "note_id": "QS. Al-Baqarah: 152",
                "type": "surah",
                "surah": [
                    {
                        "juz": 1,
                        "chapter_number": 2,
                        "chapter_name": "Al-Baqarah",
                        "verse_number": 152
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوا اذۡكُرُوۡا اللّٰهَ ذِكۡرًا كَثِيۡرًا",
                "translation_id": "Hai orang-orang yang beriman ber-dzikirlah yang banyak kepada Allah (dengan menyebut nama-Nya).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. Al-Ahzab: 41)",
                "note_id": "QS. Al-Ahzab: 41",
                "type": "surah",
                "surah": [
                    {
                        "juz": 22,
                        "chapter": 33,
                        "chapter_name": "Al-Ahzab",
                        "verse_number": 41
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اِنَّ الۡمُسۡلِمِيۡنَ وَالۡمُسۡلِمٰتِ وَالۡمُؤۡمِنِيۡنَ وَالۡمُؤۡمِنٰتِ وَالۡقٰنِتِيۡنَ وَالۡقٰنِتٰتِ وَالصّٰدِقِيۡنَ وَالصّٰدِقٰتِ وَالصّٰبِرِيۡنَ وَالصّٰبِرٰتِ وَالۡخٰشِعِيۡنَ وَالۡخٰشِعٰتِ وَالۡمُتَصَدِّقِيۡنَ وَ الۡمُتَصَدِّقٰتِ وَالصَّآٮِٕمِيۡنَ وَالصّٰٓٮِٕمٰتِ وَالۡحٰفِظِيۡنَ فُرُوۡجَهُمۡ وَالۡحٰـفِظٰتِ وَالذّٰكِرِيۡنَ اللّٰهَ كَثِيۡرًا وَّ الذّٰكِرٰتِ ۙ اَعَدَّ اللّٰهُ لَهُمۡ مَّغۡفِرَةً وَّاَجۡرًا عَظِيۡمًا",
                "translation_id": "Laki-laki dan perempuan yang banyak menyebut (nama) Allah, maka Allah menyediakan untuk mereka pengampunan dan pahala yang agung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. Al-Ahzab: 35)",
                "note_id": "QS. Al-Ahzab: 35",
                "type": "surah",
                "surah": [
                    {
                        "juz": 22,
                        "chapter": 33,
                        "chapter_name": "Al-Ahzab",
                        "verse_number": 35
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَاذْكُرْ رَّبَّكَ فِيْ نَفْسِكَ تَضَرُّعًا وَّخِيْفَةً وَّدُوْنَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالْاٰصَالِ وَلَا تَكُنْ مِّنَ الْغٰفِلِيْنَ",
                "translation_id": "Dan sebutlah (nama) Tuhanmu dalam hatimu dengan merendahkan diri dan rasa takut (pada siksaan-Nya), tidak mengeraskan suara, di pagi dan sore hari. Dan janganlah kamu termasuk orang-orang yang lalai.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. Al-A'raf: 205)",
                "note_id": "QS. Al-A'raf: 205",
                "type": "surah",
                "surah": [
                    {
                        "juz": 9,
                        "chapter": 7,
                        "chapter_name": "Al-A'raf",
                        "verse_number": 205
                    }
                ]
            },
            {
                "pre_text_id": "Rasulullah ﷺ bersabda:",
                "post_text_id": null,
                "text": "مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِيْ لاَ يَذْكُرُ رَبَّهُ مَثَلُ الْحَيِّ وَالْمَيِّتَِ",
                "translation_id": "Perumpamaan orang yang menyebut (nama) Tuhannya dengan orang yang tidak menyebut (nama)-Nya, laksana orang hidup dengan orang yang mati.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. Bukhari dalam Fathul Bari: 11/208)",
                "note_id": "HR. Bukhari dalam Fathul Bari: 11/208",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "Al-Bukhari",
                        "title": "Fathul Bari",
                        "section": 11,
                        "sub_section": 208
                    }
                ]
            },
            {
                "pre_text_id": "Rasulullah ﷺ juga bersabda:",
                "post_text_id": null,
                "text": "مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ الله َفِيْهِ وَ الْبَيْتِ الَّذِي لَا يُذْكَرُ الله فِيْهِ مَثَلُ الْحَيِّ وَالْمَيِّتِ",
                "translation_id": "Perumpamaan rumah yang digunakan untuk zikir kepada Allah dengan rumah yang tidak digunakan untuknya, laksana orang hidup dengan yang mati.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. Muslim)",
                "note_id": "HR. Muslim",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "Muslim",
                        "title": "Al-Iman",
                        "section": 1,
                        "sub_section": 539
                    }
                ]
            },
            {
                "pre_text_id": "Rasulullah ﷺ juga bersabda:",
                "post_text_id": null,
                "text": "أَلاَ أُنَبِّئُكُمْ بِخَيْرِ أَعْمَالِكُمْ، وَأَزْكَاهَا عِنْدَ مَلِيْكِكُمْ، وَأَرْفَعِهَا فيِ دَرَجَاتِكُمْ، وَخَيْرٍ لَكُمْ مِنْ إِنْفَاقِ الذَّهَبِ وَالْوَرَقِ، وَخَيْرٍ لَكُمْ مِنْ أَنْ تَلْقَوا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ؟ قَالُوا بَلَى.  قَالَ: ذِكْرُ اللهِ تَعَالَى.",
                "translation_id": "Maukah kamu, aku tunjukkan perbuatanmu yang terbaik, paling suci disisi rajamu (Allah), dan paling mengangkat derajatmu; lebih baik bagimu dari infaq emas atau perak, dan lebih baik bagimu dari-pada bertemu dengan musuhmu, lantas kamu memenggal lehernya atau mereka memenggal lehermu?\". Para shahabat yang hadir berkata: \"Mau wahai Rasulullah!\". Beliau bersabda: \"Dzikir kepada Allah yang Maha Tinggi.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. At-Tirmidzi: 5/459, Ibnu Majah: 2/1245)",
                "note_id": "HR. At-Tirmidzi: 5/459, Ibnu Majah: 2/1245",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "At-Tirmidzi",
                        "title": "Al-Witr",
                        "section": 5,
                        "sub_section": 459
                    },
                    {
                        "author": "Ibnu Majah",
                        "title": "As-Shalah",
                        "section": 2,
                        "sub_section": 1245
                    }
                ]
            },
            {
                "pre_text_id": "Allah ﷻ Yang Maha Tinggi berfirman (Dalam hadits Qudsi):",
                "post_text_id": null,
                "text": "أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إِذَا ذَكَرَنِي فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي، وَإِنْ ذَكَرَنِي فِي مَلاَءٍ ذَكَرْتُهُ فِي مَلاَءٍ خَيْرٍ مِنْهُمْ، وَإِنْ تَقَرَّبَ إِلَيَّ شِبْراً تَقَرَّبْتُ إِلَيْهِ ذِرَاعاً وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعاً تَقَرَّبْتُ إِلَيْهِ بَاعاً وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً.",
                "translation_id": "Aku terserah persangkaan hamba-Ku. Aku bersamanya (memberi rahmat dan membelanya) bila dia menyebut nama-Ku. Bila dia menyebut nama-Ku dalam dirinya, aku menyebut namanya pada diri-Ku. Bila dia menyebut nama-Ku dalam perkumpulan orang banyak, Aku menyebutnya dalam perkumpulan yang lebih banyak dari mereka. Bila dia mendekat kepada-Ku sejengkal (dengan melakukan amal shaleh atau berkata baik), maka Aku mendekat kepadanya sehasta. Bila dia mendekat kepada-Ku sehasta, maka Aku mendekat kepadanya sedepa. Bila dia datang kepada-Ku dengan berjalan (biasa), maka Aku mendatanginya dengan berjalan cepat (lari).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. At-Tirmidzi: 3/139, Ibnu Majah: 2/316)",
                "note_id": "HR. At-Tirmidzi: 3/139, Ibnu Majah: 2/316",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "Bukhari",
                        "title": "As-Shalah",
                        "section": 8,
                        "sub_section": 171
                    },
                    {
                        "author": "Ibnu Majah",
                        "title": "As-Shalah",
                        "section": 2,
                        "sub_section": 316
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَعَنْ عَبْدِ اللهِ بْنِ بُسْرٍ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلاً قَالَ: يَا رَسُوْلَ اللهِ إِنَّ شَرَاِئعَ الإِسْلاَمِ قَدْ كَثُرَتْ عَلَيَّ فَأَخْبِرْنِي بِشَيْءٍ أَتَشَبَّثُ بِهِ. قَالَ: لاَ يَزَالُ لِسَانُكَ رَطْباً مِنْ ذِكْرِ اللهِ",
                "translation_id": "Dari Abdullah bin Busr Radhiallahu'anhu dia berkata: Sesungguhnya seorang laki-laki berkata: \"Wahai Rasulullah! sesungguhnya syari'at Islam telah banyak aku terima, oleh karena itu, beri tahulah aku sesuatu hal buat peganganku\". Beliau bersabda: \"Tidak henti-hentinya lidahmu basah karena dzikir kepada Allah (lidahmu selalu mengucapkannya).\"",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. At-Tirmidzi 5/458, Ibnu Majah 2/1246)",
                "note_id": "HR. At-Tirmidzi 5/458, Ibnu Majah 2/1246",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "At-Tirmidzi",
                        "title": "Al-Witr",
                        "section": 5,
                        "sub_section": 458
                    },
                    {
                        "author": "Ibnu Majah",
                        "title": "As-Shalah",
                        "section": 2,
                        "sub_section": 1246
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "عَنْ عُقْبَةَ بْنِ عَامِرٍ رَضِيَ اللهُ عَنْهُ قَالَ: خَرَجَ رَسُوْلُ الله  وَنَحْنُ فِي الصُّفَّةِ فَقَالَ: أَيـُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيْقِ فَيَأْتِي مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلاَ قَطِيْعَةِ رَحِمٍ؟ فَقُلْنَا: يَا رَسُوْلَ اللهِ نُحِبُّ ذَلِكَ. قَالَ: أَفَلاَ يَغْدُو أَحَدُكُمْ إِلىَ الْمَسْجِدِ فَيُعَلِّم، أَوْ يَقْرَأَ آيَتَيْنِ مِنْ كِتَابِ اللهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ، وَثَلاَثٌ خَيْرٌ لَهُ مِنْ ثَلاَثٍ، وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنَ اْلإِبِلِ.",
                "translation_id": "Dari Uqbah bin Amir Radhiallahu'anhu, dia berkata: \"Rasulullah Shallallahu'alaihi wasallam keluar, sedang kami di serambi masjid (Madinah). Lalu beliau bersabda: \"Siapakah di antara kamu yang senang berangkat pagi pada tiap hari ke Buthhan atau Al-Aqiq, lalu kembali dengan membawa dua unta yang besar punuknya, tanpa mengerjakan dosa atau memutus sanak?” Kami (yang hadir) berkata: \"Ya kami senang, wahai Rasulullah!” Lalu beliau bersabda: \"Apakah seseorang di antara kamu tidak berangkat pagi ke masjid, lalu memahami atau membaca dua ayat Al-Qur'an, hal itu lebih baik baginya daripada dua unta.  Dan (bila memahami atau membaca) tiga (ayat) akan lebih baik daripada memperoleh tiga (unta). Dan (bila memahami atau mengajar) empat ayat akan lebih baik baginya daripada memperoleh empat (unta), dan demikian dari seluruh bilangan unta.\"",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. Muslim 1/553)",
                "note_id": "HR. Muslim 1/553",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "Muslim",
                        "title": "Al-Iman",
                        "section": 1,
                        "sub_section": 553
                    }
                ]
            },
            {
                "pre_text_id": "Rasulullah ﷺ juga bersabda:",
                "post_text_id": null,
                "text": "مَنْ قَعَدَ مَقْعَداً لَمْ يَذْكُرِ اللهَ فِيْهِ كَانَـتْ عَلَيْهِ مِنَ اللهِ تِرَةٌ، وَمَنِ اضْطَجَــــعَ مَضْجَـعاً لَمْ يَذْكُرِ اللهَ فِيْهِ كَانَتْ عَلَيْهِ مِنَ اللهِ تِرَةٌ.",
                "translation_id": "Barangsiapa yang duduk di suatu tempat, lalu tidak berdzikir kepada Allah di dalamnya, pastilah dia mendapatkan hukuman dari Allah dan barangsiapa yang berbaring dalam suatu tempat lalu tidak berdzikir kepada Allah, pastilah mendapatkan hukuman dari Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. Abu Dawud 4/264; Shahihul Jaami' 5/342)",
                "note_id": "HR. Abu Dawud 4/264; Shahihul Jaami' 5/342",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "Abu Dawud",
                        "title": "At-Thaharah",
                        "section": 4,
                        "sub_section": 264
                    },
                    {
                        "author": null,
                        "title": null,
                        "section": 5,
                        "sub_section": 342
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَا جَلَسَ قَوْمٌ مَجْلِساً لَمْ يَذْكُرُوا اللهَ فِيْهِ، وَلَمْ يُصَلُّوا عَلَى نَبِيِّهِمْ إِلاَّ كَانَ عَلَيْهِمْ تِرَةٌ فَإِنْ شَاءَ عَذَّبَهُمْ وَإِنْ شَاءَ غَفَرَ لَهُمْ.",
                "translation_id": "Apabila suatu kaum duduk di majlis, lantas tidak berdzikir kepada Allah dan tidak membaca shalawat kepada Nabi-Nya, niscaya mereka mendapat sesuatu yang tidak disenangi dari Allah. Apabila Allah berkehendak, maka Dia akan menyiksa mereka; dan apabila tidak, Allah akan mengampuni dosa mereka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. At-Tirmidzi 3/140)",
                "note_id": "HR. At-Tirmidzi 3/140",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "At-Tirmidzi",
                        "title": "At-Witr",
                        "section": 3,
                        "sub_section": 140
                    }
                ]
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَا مِنْ قَوْمٍ يَقُوْمُوْنَ مِنْ مَجْلِسٍ لاَ يَذْكُرُوْنَ اللهَ فِيْهِ إِلاَّ قَامُوا عَنْ مِثْلِ جِيْفَةِ حِمَارٍ وَكَانَ لَهُمْ حَسْرَةٌ",
                "translation_id": "Setiap kaum yang berdiri dari suatu majelis, yang mereka tidak berdzikir kepada Allah di dalamnya, maka mereka laksana berdiri dari bangkai keledai dan hal itu menjadi penyesalan mereka (di hari Kiamat).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(HR. At-Tirmidzi 3/140)",
                "note_id": "HR. At-Tirmidzi 3/140",
                "type": "hadith",
                "hadith": [
                    {
                        "author": "At-Tirmidzi",
                        "title": "At-Witr",
                        "section": 3,
                        "sub_section": 140
                    }
                ]
            }
        ]
    },
    {
        "title_en": "Du'a when waking up from sleep",
        "title_id": "Do'a ketika bangun dari tidur",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَاناَ بَعْـدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
                "translation_id": "Segala puji bagi Allah Yang membangunkan kami setelah ditidurkan-Nya dan kepada-Nya kami dibangkitkan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when wearing clothes",
        "title_id": "Do'a ketika mengenakan pakaian",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَاناَ بَعْـدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
                "translation_id": "Segala puji bagi Allah Yang membangunkan kami setelah ditidurkan-Nya dan kepada-Nya kami dibangkitkan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when wearing new clothes",
        "title_id": "Do'a ketika mengenakan pakaian baru",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ.",
                "translation_id": "Ya Allah, hanya milik-Mu segala puji, Engkaulah yang memberi pakaian ini kepadaku. Aku mohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang ia diciptakan karena-nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for peoples who wearing new clothes",
        "title_id": "Do'a bagi orang yang mengenakan pakaian baru",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى.",
                "translation_id": "Kenakanlah sampai lusuh, semoga Allah ta'ala memberikan gantinya kepadamu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اِلْبِسْ جَدِيْدًا، وَعِشْ حَمِيْدًا، وَمُتْ شَهِيْدًا.",
                "translation_id": "Berpakaianlah yang baru, hiduplah dengan terpuji dan matilah dalam keadaan syahid.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when putting clothes on",
        "title_id": "Do'a ketika meletakkan pakaian",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ.",
                "translation_id": "Dengan nama Allah (aku meletakkan baju).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a come in to bathroom (toilet)",
        "title_id": "Do'a masuk ke kamar mandi (WC)",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "(بِسْمِ اللهِ) اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ.",
                "translation_id": "Dengan nama Allah. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a come out from the toilet",
        "title_id": "Do'a keluar dari kamar mandi (WC)",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "غُفْرَانَكَ.",
                "translation_id": "Aku minta ampun kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a before wudhu",
        "title_id": "Do'a sebelum wudhu",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ.",
                "translation_id": "Dengan nama Allah (aku berwudhu).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a after wudhu",
        "title_id": "Do'a setelah wudhu",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": " أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ.",
                "translation_id": "Aku bersaksi, bahwa tiada Tuhan yang haq kecuali Allah, Yang Maha Esa dan tiada sekutu bagi-Nya. Aku bersaksi, bahwa Muhammad adalah hamba dan utusan-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when leaving the house",
        "title_id": "Do'a ketika keluar rumah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ.",
                "translation_id": "Dengan nama Allah (aku keluar). Aku bertawakkal kepada-Nya, dan tiada daya dan kekuatan kecuali karena pertolongan Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when entering the house",
        "title_id": "Do'a ketika masuk rumah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ وَلَجْنَا، وَبِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ.",
                "translation_id": "Dengan nama Allah, kami masuk (ke rumah), dengan nama Allah, kami keluar (darinya) dan kepada Tuhan kami, kami bertawakkal\". Kemudian mengucapkan salam kepada keluarga-nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when goes to the mosque",
        "title_id": "Do'a ketika pergi ke masjid",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللّٰهُمَّ اجْعَلْ فِىْ قَلْبِى نُوْرًاوَفِى لْسَانِىْ نُوْرًا.وَاجْعَلْنِى فِى سَمْعِىْ نُوْرًا.وَاجْعَلْ فِى بَصَرِىْ ُوْرًا.وَاجْعَلْ مِنْ خَلْفِىْ نُوْرًا.وَمِنْ اَمَامِى نُوْرًا.وَاجْعَلْ مِنْ فَوْقِى نُوْرًاوَمِنْ تَحْتِى نُوْرًا.اَللّٰهُمَّ اعْطِنِى نُوْرًا.",
                "translation_id": "Ya Allah, jadikanlah cahaya di hatiku, cahaya di lidahku, cahaya di pendengaranku, cahaya di penglihatanku, cahaya dari belakangku, cahaya dari mukaku, cahaya dari atasku, dan cahaya dari bawahku . Ya Allah, berilah aku cahaya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when entering the mosque",
        "title_id": "Do'a ketika masuk masjid",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِاللهِ الْعَظِيْمِ، وَبِوَجْهِهِ الْكَرِيْمِ، وَسُلْطَانِهِ الْقَدِيْمِ، مِنَ الشَّيْطَانِ الرَّجِيْمِ، (بِسْمِ اللهِ، وَالصَّلاَةُ) (وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ) اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ.",
                "translation_id": "Aku berlindung kepada Allah Yang Maha Agung, dengan wajah-Nya Yang Mulia dan kekuasaan-Nya yang abadi, dari setan yang terkutuk. Dengan nama Allah dan semoga shalawat dan salam tercurahkan kepada Rasulullah Ya Allah, bukalah pintu-pintu rahmat-Mu untukku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when leaving the mosque",
        "title_id": "Do'a ketika keluar masjid",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ، اَللَّهُمَّ اعْصِمْنِيْ مِنَ الشَّيْطَانِ الرَّجِيْمِ.",
                "translation_id": "Dengan nama Allah, semoga shalawat dan salam terlimpahkan kepada Rasulullah. Ya Allah, sesungguhnya aku minta kepada-Mu dari karunia-Mu. Ya Allah, peliharalah aku dari godaan setan yang terkutuk.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when leaving the mosque",
        "title_id": "Do'a ketika keluar masjid",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَقُوْلُ مِثْلَ مَا يَقُوْلُ الْمُؤَذِّنُ إِلاَّ فِيْ (حَيََّ عَلَى الصَّلاَةِ وَ حَيََّ عَلَى الْفَلاَحِ) فَيُبْدِلُهُمَا: لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
                "translation_id": "Seseorang yang mendengarkan adzan, hendaklah mengucapkan sebagaimana yang diucapkan oleh muadzin, kecuali dalam kalimat: Hayya 'alash shalaah dan Hayya 'alal falaah. Maka mengucapkan: 'Laa haula wala quwwata Illa billah'.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": " (( وَأَنَا أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَبِمُحَمَّدٍ رَسُوْلاً، وَبِاْلإِسْلاَمِ دِيْنًا ))",
                "translation_id": "Aku bersaksi, bahwa tiada Tuhan yang haq selain Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya dan sesungguhnya Muhammad adalah hamba dan utusan-Nya. Aku rela Allah sebagai Tuhanku, Muhammad sebagai Rasul dan Islam sebagai agama (yang benar).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca setelah muadzin membaca syahadat)"
            },
            {
                "pre_text_id": "Membaca shalawat atas Nabi ﷺ sesudah adzan.",
                "post_text_id": "Berdo'a untuk diri sendiri antara adzan dan iqamah, sebab do' pada waktu itu dikabulkan.",
                "text": " اَللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيْلَةَ وَالْفَضِيْلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُوْدًا الَّذِيْ وَعَدْتَهُ، (إِنَّكَ لاَ تُخْلِفُ الْمِيْعَادَ).",
                "translation_id": "Ya Allah, Tuhan Pemilik panggilan yang sempurna (adzan) ini dan shalat (wajib) yang didirikan. Berilah Al-Wasilah (derajat di Surga, yang tidak akan diberikan selain kepada Nabi ﷺ) dan fadhilah kepada Muhammad. Dan bangkitkanlah beliau sehingga bisa menempati maqam terpuji yang telah Engkau janjikan. Sesungguhnya Engkau tidak menyalahi janji",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a Istiftah",
        "title_id": "Do'a Istiftah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اَللَّهُمَّ نَقِّنِيْ مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ اْلأَبْيَضُ مِنَ الدَّنَسِ، اَللَّهُمَّ اغْسِلْنِيْ مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
                "translation_id": "Ya Allah, jauhkan antara aku dan kesalahan-kesalahanku, sebagaimana Engkau menjauhkan antara timur dan barat. Ya Allah, bersihkanlah aku dan kesalahan-kesalahanku, sebagaimana baju putih dibersihkan dari kotoran. Ya Allah, cucilah aku dari kesalahan-kesalahanku dengan, es, air dan salju.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَـهَ غَيْرُكَ.",
                "translation_id": "Maha Suci Engkau ya Allah, aku memuji-Mu, Maha Berkah akan nama-Mu, Maha Tinggi kekayaan dan kebesaran-Mu, tiada Ilah yang berhak disembah selain Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَاوَاتِ وَاْلأَرْضَ حَنِيْفًا وَمَا أَنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلاَتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلَّهِ رَبِّ الْعَالَمِيْنَ، لاَ شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِيْنَ. اَللَّهُمَّ أَنْتَ الْمَلِكُ   لاَ إِلَـهَ إِلاَّ أَنْتَ. أَنْتَ رَبِّيْ وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْلِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ. وَاهْدِنِيْ لأَحْسَنِ اْلأَخْلاَقِ لاَ يَهْدِيْ لأَحْسَنِهَا إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لاَ يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
                "translation_id": "Aku menghadap kepada Tuhan Pencipta langit dan bumi, dengan memegang agama yang lurus dan aku tidak tergolong orang-orang yang musyrik. Sesungguhnya shalat, ibadah dan hidup serta matiku adalah untuk Allah. Tuhan seru sekalian alam, tiada sekutu bagi-Nya, dan karena itu, aku diperintah dan aku termasuk orang-orang muslim. Ya Allah, Engkau adalah Raja, tiada Tuhan (yang berhak disembah) kecuali Engkau, engkau Tuhanku dan aku adalah hamba-Mu. Aku menganiaya diriku, aku mengakui dosaku (yang telah kulakukan). Oleh karena itu, ampunilah seluruh dosaku, sesungguhnya tidak akan ada yang mengampuni dosa-dosa, kecuali Engkau. Tunjukkan aku pada akhlak yang terbaik, tidak akan menunjukkan kepadanya kecuali Engkau. Hindarkan aku dari akhlak yang jahat, tidak akan ada yang bisa menjauhkan aku daripadanya, kecuali Engkau. Aku penuhi panggilan-Mu dengan kegembiraan, seluruh kebaikan di kedua tangan-Mu, kejelekan tidak dinisbahkan kepada-Mu. Aku hidup dengan pertolongan dan rahmat-Mu, dan kepada-Mu (aku kembali). Maha Suci Engkau dan Maha Tinggi. Aku minta ampun dan bertaubat kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ رَبَّ جِبْرَائِيْلَ، وَمِيْكَائِيْلَ، وَإِسْرَافِيْلَ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ. اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيْمٍ.",
                "translation_id": "Ya Allah, Tuhan Jibril, Mikail dan Israfil. Wahai Pencipta langit dan bumi. Wahai Tuhan yang mengetahui yang ghaib dan nyata. Engkau yang menjatuhkan hukum (untuk memutuskan) apa yang mereka (orang-orang Nasrani dan Yahudi) perselisihkan. Tunjukkanlah aku pada kebenaran apa yang dipertentangkan dengan seizin dari-Mu. Sesungguhnya Engkau menunjukkan pada jalan yang lurus bagi orang yang Engkau kehendaki.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "(( اَللهُ أَكْبَرُ كَبِيْرًا، اَللهُ أَكْبَرُ كَبِيْرًا، اَللهُ أَكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلَّهِ كَثِيْرًا، وَالْحَمْدُ لِلَّهِ كَثِيْرًا، وَالْحَمْدُ لِلَّهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَأَصِيْلاً)) ثلاثا (( أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ، مِنْ نَفْخِهِ وَنَفْثِهِ وَهَمْزِهِ )).",
                "translation_id": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak. Maha Suci Allah di waktu pagi dan sore\". (Diucapkan tiga kali). \"Aku berlindung kepada Allah dari tiupan, bisikan dan godaan setan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "كَانَ النَّبِيُّ ﷺ إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ قَالَ: اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُوْرُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَاوَاتِ وَاْلأَرْضِ, وَلَكَ الْحَمْدُ, أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّهُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّوْنَ حَقٌّ، وَمُحَمَّدٌ ﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ, اَللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ, أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَـهَ إِلاَّ أَنْتَ, أَنْتَ إِلَـهِيْ لاَ إِلَـهَ إِلاَّ أَنْتَ.",
                "translation_id": "Apabila Nabi ﷺ shalat tahajud di waktu malam, beliau membaca: \"Ya, Allah! Bagi-Mu segala puji, Engkau cahaya langit dan bumi serta seisinya. Bagi-Mu segala puji, Engkau yang mengurusi langit dan bumi serta seisinya. Bagi-Mu segala puji, Engkau Tuhan yang menguasai langit dan bumi serta seisinya. Bagi-Mu segala puji dan bagi-Mu kerajaan langit dan bumi serta seisi-nya. Bagi-Mu segala puji, Engkau benar, janji-Mu benar, firman-Mu benar, bertemu dengan-Mu benar, Surga adalah benar (ada), Neraka adalah benar (ada), (terutusnya) para nabi adalah benar, (terutusnya) Muhammad adalah benar (dari-Mu), peristiwa hari kiamat adalah benar. Ya Allah, kepada-Mu aku pasrah, kepada-Mu aku bertawakal, kepada-Mu aku beriman, kepada-Mu aku kembali (bertaubat), dengan pertolongan-Mu aku berdebat (kepada orang-orang kafir), kepada-Mu (dan dengan ajaran-Mu) aku menjatuhkan hukum. Oleh karena itu, ampunilah dosaku yang telah lalu dan yang akan datang. Engkaulah yang mendahulukan dan mengakhirkan, tiada Tuhan yang hak disembah kecuali Engkau, Engkau adalah Tuhanku, tidak ada Tuhan yang hak disembah kecuali Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a Ruku'",
        "title_id": "Do'a Ruku'",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "((سُبْحَانَ رَبِّيَ الْعَظِيْمِ)) ٣×.",
                "translation_id": "Maha Suci Tuhanku yang Maha Agung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 3 kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ.",
                "translation_id": "Maha Suci Engkau, ya Allah! Tuhan-ku, dan dengan pujianku pada-Mu. Ya Allah! Ampuni-lah dosaku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبُّوْحٌ قُدُّوْسٌ، رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ.",
                "translation_id": "Engkau, Tuhan Yang Maha Suci (dari kekurangan dan hal yang tidak layak bagi kebesaran-Mu), Maha Agung, Tuhan para malaikat dan Jibril.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ وَبَصَرِيْ وَمُخِّيْ وَعَظْمِيْ وَعَصَبِيْ وَمَا اسْتَقَلَّ بِهِ قَدَمِيْ.",
                "translation_id": "Ya Allah, untuk-Mu aku ruku'. Kepada-Mu aku beriman, kepada-Mu aku pasrah. Pendengaranku, penglihatanku, otak-ku, tulangku, syarafku dan apa yang berdiri di atas dua tapak kakiku, telah tunduk dengan khusyuk kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ ذِي الْجَبَرُوْتِ وَاْلمَلَكُوْتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.",
                "translation_id": "Maha Suci (Allah) Yang memiliki Keperkasaan, Kerajaan, Kebesaran dan Keagungan.",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a waking up from Ruku'",
        "title_id": "Do'a bangun dari Ruku'",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ.",
                "translation_id": "Semoga Allah mendengar pujian orang yang memuji-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبَارَكًا فِيْهِ.",
                "translation_id": "Wahai Tuhan kami, bagi-Mu segala puji, aku memuji-Mu dengan pujian yang banyak, yang baik dan penuh dengan berkah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مِلْءَ السَّمَاوَاتِ وَمِلْءَ اْلأَرْضِ وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ. أَهْلَ الثَّنَاءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
                "translation_id": "(Aku memuji-Mu dengan) pujian sepenuh langit dan sepenuh bumi, sepenuh apa yang di antara keduanya, sepenuh apa yang Engkau kehendaki setelah itu. Wahai Tuhan yang layak dipuji dan diagungkan, Yang paling berhak dikatakan oleh seorang hamba dan kami seluruhnya adalah hamba-Mu. Ya Allah tidak ada yang dapat menghalangi apa yang Engkau berikan dan tidak ada pula yang dapat memberi apa yang Engkau halangi, tidak bermanfaat kekayaan bagi orang yang memilikinya (kecuali iman dan amal shalihnya), hanya dari-Mu kekayaan itu",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a Sujud",
        "title_id": "Do'a Sujud",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "((سُبْحَانَ رَبِّيَ اْلأَعْلَى)) ٣×.",
                "translation_id": "Maha Suci Tuhanku, Yang Maha Tinggi (dari segala kekurangan dan hal yang tidak layak).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": " (Dibaca 3 kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ.",
                "translation_id": "Maha Suci Engkau. Ya Allah, Tuhan kami, aku memuji-Mu. Ya Allah, ampunilah dosaku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبُّوْحٌ قُدُّوْسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ.",
                "translation_id": "Engkau Tuhan Yang Maha Suci, Maha Agung, Tuhan para malaikat dan Jibril.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِيْ خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أَحْسَنُ الْخَالِقِيْنَ.",
                "translation_id": "Ya Allah, untuk-Mulah aku bersujud, kepada-Mulah aku beriman, kepada-Mu aku menyerahkan diri, wajahku bersujud kepada Tuhan Yang menciptakannya, Yang membentuk rupanya, Yang membelah (memberikan) pendengarannya, penglihatannya, Maha Suci Allah sebaik-baik Pencipta.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ ذِي الْجَبَرُوْتِ وَاْلمَلَكُوْتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.",
                "translation_id": "Maha Suci Tuhan Yang memiliki Keperkasaan, Kerajaan, Kebesaran dan Keagungan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ اغْفِرْ لِيْ ذَنْبِيْ كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ وَعَلاَنِيَّتَهُ وَسِرَّهُ.",
                "translation_id": "Ya Allah, ampunilah seluruh dosa-ku yang kecil dan besar, yang telah lewat dan yang akan datang, yang kulakukan dengan terang-terangan dan yang tersembunyi.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِيْ ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ.",
                "translation_id": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dengan keridhaan-Mu (agar selamat) dari kebencian-Mu, dan dengan keselamatan-Mu (agar terhindar) dari siksaan-Mu. Aku tidak membatasi pujian kepada-Mu. Engkau (dengan kebesaran dan keagungan-Mu) adalah sebagai-mana pujian-Mu kepada diri-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a ",
        "title_id": "Do'a ",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "رَبِّ اغْفِرْ لِيْ رَبِّ اغْفِرْ لِيْ.",
                "translation_id": "Wahai Tuhanku, ampunilah dosaku, wahai Tuhanku, ampunilah dosaku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاهْدِنِيْ وَاجْبُرْنِيْ وَعَافِنِيْ وَارْزُقْنِيْ وَارْفَعْنِي.",
                "translation_id": "Ya Allah, ampunilah dosaku, berilah rahmat kepadaku, tunjukilah aku (ke jalan yang benar), cukupkanlah aku, selamatkan aku (tubuh sehat dan keluarga terhindar dari musibah), berilah aku rezki (yang halal) dan angkatlah derajatku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a Sujud Tilawah",
        "title_id": "Do'a Sujud Tilawah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سَجَدَ وَجْهِيَ لِلَّذِيْ خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ، فَتَبَارَكَ اللهُ أَحْسَنُ الْخَالِقِيْنَ.",
                "translation_id": "Bersujud wajahku kepada Tuhan yang menciptakannya, yang membelah pendengaran dan penglihatannya dengan Daya dan Kekuatan-Nya, Maha Suci Allah sebaik-baik Pencipta.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ اكْتُبْ لِيْ بِهَا عِنْدَكَ أَجْرًا، وَضَعْ عَنِّيْ بِهَا وِزْرًا، وَاجْعَلْهَا لِيْ عِنْدَكَ ذُخْرًا، وَتَقَبَّلْهَا مِنِّيْ كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.",
                "translation_id": "Ya Allah, tulislah untukku dengan sujudku pahala di sisi-Mu dan ampunilah dengannya akan dosaku, serta jadikanlah simpanan untukku di sisi-Mu dan terimalah sujudku sebagaimana Engkau telah menerimanya dari hamba-Mu Dawud",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Tasyahud",
        "title_id": "Tasyahud",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِيْنَ. أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ.",
                "translation_id": "Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepadamu, wahai Nabi, begitu juga rahmat dan berkah-Nya. Kesejahteraan semoga terlimpahkan kepada kita dan hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Tuhan yang hak disembah selain Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading the Prophet's ﷺ Salawat After Tasyahud",
        "title_id": "Membaca Shalawat Nabi ﷺ Setelah Tasyahud",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ.",
                "translation_id": "Ya Allah, berilah rahmat kepada Muhammad dan keluarganya, sebagaimana Engkau telah memberikan rahmat kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji dan Maha Agung. Berilah berkah kepada Muhammad dan keluarganya (termasuk anak dan istri atau umatnya), sebagaimana Engkau telah memberi berkah kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji dan Maha Agung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيْمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ.",
                "translation_id": "Ya Allah, berilah rahmat kepada Muhammad, istri-istri dan keturunannya,sebagaimanaEngkau telah memberikan rahmat kepada keluarga Ibrahim. Berilah berkah kepada Muhammad, istri-istri dan keturunannya,sebagaimana engkau telah memberkahi kepada keluarga Ibrahim.Sesungguhnya Engkau Maha Terpuji dan Maha Agung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a after last Tasyahud before salam",
        "title_id": "Do'a setelah Tasyahud akhir sebelum salam",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ.",
                "translation_id": "Ya Allah, Sesungguhnya aku berlindung kepada-Mu dari siksa kubur, siksa neraka Jahanam, fitnah kehidupan dan setelah mati, serta dari kejahatan fitnah Almasih Dajjal.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ.",
                "translation_id": "Ya Allah! Sesungguhnya aku berlindung kepada-Mu dari siksa kubur. Aku berlindung kepada-Mu dari fitnah Almasih Dajjal. Aku berlindung kepada-Mu dari fitnah kehidupan dan sesudah mati. Ya Allah, Sesungguhnya aku berlindung kepada-Mu dari perbuatan dosa dan kerugian.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا، وَلاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِيْ مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ.",
                "translation_id": "Ya Allah! Sesungguhnya aku banyak menganiaya diriku, dan tidak ada yang mengampuni dosa-dosa kecuali Engkau. Oleh karena itu, ampunilah dosa-dosaku dan berilah rahmat kepadaku. Sesungguhnya Engkau Maha Pengampun dan Maha Penyayang.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ اغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّيْ. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَـهَ إِلاَّ أَنْتَ.",
                "translation_id": "Ya Allah! Ampunilah aku akan (dosaku) yang aku lewatkan dan yang aku akhirkan, apa yang aku rahasiakan dan yang kutampakkan, yang aku lakukan secara berlebihan, serta apa yang Engkau lebih mengetahui dari pada diriku, Engkau yang mendahulukan dan mengakhirkan, tidak ada Tuhan yang berhak disembah kecuali Engkau",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ أَعِنِّيْ عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ.",
                "translation_id": "Ya Allah! Berilah pertolongan kepadaku untuk menyebut nama-Mu, mensyukuri-Mu dan ibadah yang baik kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمْرِ، وَأَعُوْذُ بِكَ مِنَ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ.",
                "translation_id": "Ya Allah! Sesungguhnya aku berlindung kepada-Mu dari bakhil, aku berlindung kepada-Mu dari penakut, aku berlindung kepada-Mu dari dikembalikan ke usia yang terhina, dan aku berlindung kepada-Mu dari fitnah dunia dan siksa kubur.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ وَأَعُوْذُ بِكَ مِنَ النَّارِ.",
                "translation_id": "Ya Allah! Sesungguhnya aku mohon kepada-Mu, agar dimasukkan ke Surga dan aku berlindung kepada-Mu dari Neraka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيْمًا لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ يَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلاَ فِتْنَةٍ مُضِلَّةٍ، اَللَّهُمَّ زَيِّنَّا بِزِيْنَةِ اْلإِيْمَانِ وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.",
                "translation_id": "Ya Allah, dengan ilmu-Mu atas yang gaib dan dengan keMaha Kuasaan-Mu atas seluruh makhluk, perpanjanglah hidupku, bila Engkau mengetahui bahwa kehidupan selanjutnya lebih baik bagiku. Dan matikan aku dengan segera, bila Engkau mengetahui bahwa kematian lebih baik bagiku. Ya Allah, sesungguhnya aku mohon kepada-Mu agar aku takut kepada-Mu dalam keadaan sembunyi (sepi) atau ramai. Aku mohon kepada-Mu, agar dapat berpegang dengan kalimat hak di waktu rela atau marah. Aku minta kepada-Mu, agar aku bisa melaksanakan kesederhanaan dalam keadaan kaya atau fakir, aku mohon kepada-Mu agar diberi nikmat yang tidak akan habis dan aku minta kepada-Mu, agar diberi penyejuk mata yang tak terputus. Aku mohon kepada-Mu agar aku dapat rela setelah qadha'-Mu (turun pada kehidupanku). Aku mohon kepada-Mu, kehidupan yang menyenangkan setelah aku meninggal dunia. Aku mohon kepada-Mu kenikmatan memandang wajah-Mu, rindu bertemu dengan-Mu tanpa penderitaan yang membahayakan dan fitnah yang menyesatkan. Ya Allah, hiasilah kami dengan keimanan dan jadikanlah kami sebagai penunjuk jalan (lurus) yang memperoleh bimbingan dari-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ يَا اَللهُ بِأَنَّكَ الْوَاحِدُ اْلأَحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ.",
                "translation_id": "Ya Allah! Sesungguhnya aku mohon kepada-Mu, ya Allah! Dengan bersaksi bahwa Engkau adalah Tuhan Yang Maha Esa, Maha Tunggal tidak membutuhkan sesuatu, tapi segala sesuatu butuh kepada-Mu, tidak beranak dan tidak diperanakkan, tidak ada seorang pun yang menyamai-Mu, aku mohon kepada-Mu agar mengampuni dosa-dosaku. Sesungguhnya Engkau Maha Pengampun dan Maha Penyayang.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلَـهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَاوَاتِ وَاْلأَرْضِ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامِ، يَا حَيُّ يَا قَيُّوْمُ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ وَأَعُوْذُ بِكَ مِنَ النَّارِ.",
                "translation_id": "Ya Allah! Aku mohon kepada-Mu. Sesungguhnya bagi-Mu segala pujian, tiada Tuhan (yang hak disembah) kecuali Engkau Yang Maha Esa, tiada sekutu bagi-Mu, Maha Pemberi nikmat, Pencipta langit dan bumi tanpa contoh sebelumnya. Wahai Tuhan Yang Maha Agung dan Maha Pemurah, wahai Tuhan Yang Hidup, wahai Tuhan yang mengurusi segala sesuatu, sesungguhnya aku mohon kepada-Mu agar dimasukkan ke Surga dan aku berlindung kepada-Mu dari siksa Neraka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ بِأَنِّيْ أَشْهَدُ أَنَّكَ أَنْتَ لاَ إِلَـهَ إِلاَّ أَنْتَ اْلأَحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.",
                "translation_id": "Ya Allah, aku mohon kepada-Mu dengan bersaksi, bahwa Engkau adalah Allah, tiada Tuhan (yang berhak disembah) kecuali Engkau, Maha Esa, tidak membutuhkan sesuatu tapi segala sesuatu butuh kepada-Mu, tidak beranak dan tidak diperanakkan, tidak seorang pun yang menyamai-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Dhikr after shalat",
        "title_id": "Dzikir selesai shalat",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَسْتَغْفِرُ اللهَ (ثَلاَثاً) اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَـا ذَا الْجَلاَلِ وَاْلإِكْرَامِ",
                "translation_id": "Aku minta ampun kepada Allah (dibaca tiga kali), Ya Allah, Engkau pemberi keselamatan, dan dari-Mu keselamatan, Maha Suci Engkau, wahai Tuhan Yang Maha Agung dan Maha Mulia.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، لاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                "translation_id": "Tiada Tuhan selain Allah Yang Maha Esa, tidak ada sekutu bagi-Nya. Bagi-Nya puji dan bagi-Nya Kerajaan. Dia Maha Kuasa atas segala sesuatu. Ya Allah tidak ada yang dapat mencegah apa yang Engkau berikan dan tidak ada yang mampu memberi apa yang Engkau cegah. Nasib baik seseorang tiada berguna untuk menyelamatkan ancaman dari-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. لاَحَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ، لاَ إِلَهَ إِلاَّ اللهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لاَ إِلَهَ إِلاَّ اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنُ وَلَوْ كَرِهَ الْكَافِرُوْنَ",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujaan. Dia Maha Kuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali (dengan pertolongan) Allah. Tiada Tuhan yang berhak disembah selain Allah. Kami tidak menyembah kecuali kepada-Nya. Baginya nikmat, anugerah, dan pujaan yang baik. Tiada Tuhan yang berhak disembah selain Allah, dengan memurnikan ibadah kepada-Nya, sekalipun orang-orang kafir membencinya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَاللهُ أَكْبَرُ (ثَلاَثًا وَثَلاَثِيْنَ) لاَ إِلَهَ إِلاَّ اللهُ وَحْـدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
                "translation_id": "Maha Suci Allah, Segala puji bagi Allah, Allah Maha Besar (di-baca 33 kali), Tiada Tuhan yang berhak disembah selain Allah semata, tidak ada sekutu bagi-Nya, bagi-Nya kerajaan, bagi-Nya pujian dan Dia berkuasa atas segala sesuatu",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "Dibaca setiap selesai shalat fardhu'.",
                "text": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِۚ ﴿ قُلْ هُوَ اللّٰهُ اَحَدٌۚ (١) اَللّٰهُ الصَّمَدُۚ (٢) لَمْ يَلِدْ وَلَمْ يُوْلَدْۙ (٣) وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ (٤) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ (١) مِنْ شَرِّ مَا خَلَقَۙ  (٢) وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ (٣) وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِۙ (٤) وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ (٥) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ (١) مَلِكِ النَّاسِۙ (٢) اِلٰهِ النَّاسِۙ (٣) مِنْ شَرِّ الْوَسْوَاسِ ەۙ الْخَنَّاسِۖ (٤) الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِۙ (٥) مِنَ الْجِنَّةِ وَالنَّاسِ (٦) ﴾",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                "translation_id": "Allah, tidak ada Tuhan (yang berhak disembah), melainkan Dia yang hidup kekal, lagi terus menerus mengurus (makhluk-Nya). Tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa'at di sisi Allah tanpa seizin-Nya. Allah mengetahui apa-apa yang ada di hadapan mereka dan di belakang mereka. Dan mereka tidak mengetahui apa-apa dari ilmu Allah, melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya. Dan Allah Maha Tinggi lagi Maha Besar.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيْتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٍ (عَشْرَ مَرَّاتٍ بَعْدَ صَلَاةِ اْلمَغْرِبِ وَالصُّبْحِ)",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah semata, tidak ada sekutu bagi-Nya, bagi-Nya kerajaan, bagi-Nya pujian, Dia Menghidupkan dan Mematikan dan Dia berkuasa atas segala sesuatu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 10 kali setelah shalat Maghrib dan Subuh)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً ( بَعْد السَّلاَمِ مِنْ صَلاَةِ الفَجْر)",
                "translation_id": "Ya Allah, sesungguhnya aku mohon kepada-Mu ilmu yang bermanfaat, rezki yang baik dan amal yang diterima.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Diucapkan setelah salam khusus shalat Subuh)"
            }
        ]
    },
    {
        "title_en": "Du'a Shalat Istikharah",
        "title_id": "Do'a Shalat Istikharah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": "Tidak akan menyesal bagi orang yang beristikharah kepada Sang Pencipta dan bermusyawarah kepada Makhluk-Nya yang beriman dan berhati-hati dalam menangani persoalan.",
                "text": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوْبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْــرَ –وَيُسَمِّي حَاجَتَهُ- خَيْرٌ لِي فِي دِيْنِي وَمَعاَشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ- فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيْهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا اْلأَمْرَ شَرٌّ لِي فِي دِيْنِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي –أَوْقَالَ: عَاجِلِهِ وَآجِلِهِ – فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ",
                "translation_id": "Ya Allah, sesungguhnya aku minta pilihan yang tepat kepada-Mu dengan ilmu pengetahuan-Mu, dan aku mohon kekuasaan-Mu (untuk mengatasi persoalanku) dengan ke-Maha Kuasaan-Mu. Aku mohon kepada-Mu sesuatu dari anugerah-Mu yang Maha Agung, sesungguhnya Engkau Maha Kuasa, sedang aku tidak kuasa, Engkau mengetahui, sedang aku tidak mengetahuinya dan Engkau adalah Maha Mengetahui hal yang ghaib. Ya Allah apabila Engkau mengetahui bahwa urusan ini (disebutkan masalahnya) lebih baik dalam agamaku, dan akibatnya terhadap diriku – atau Nabi ﷺ bersabda \"di dunia atau di akhirat\"- takdirkanlah untukku, mudahkan-lah jalannya, kemudian berilah berkah. Akan tetapi apabila Engkau mengetahui bahwa persoalan ini lebih berbahaya bagiku dalam agama, perekonomian dan akibatnya kepada diriku, maka singkirkanlah persoalan tersebut dan jauhkan aku daripadanya, takdirkan kebaikan untukku dimana saja kebaikan itu berada, kemudian berilah kerelaan-Mu kepadaku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Allah ﷻ berfirman:",
                "post_text_id": null,
                "text": "وَشَاوِرْهُمْ فِى ٱلْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى ٱللَّهِ",
                "translation_id": "... Dan bermusyawarahlah kepada mereka (para shahabat) dalam urusan itu. Bila kamu telah membulatkan tekad, bertawakkal-lah kepada Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. Ali Imran: 159)"
            }
        ]
    },
    {
        "title_en": "Morning and night Dhikr",
        "title_id": "Dzikir pagi dan petang",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ:",
                "translation_id": "Dari Anas dengan jalan Marfu': \"Sungguh aku duduk bersama suatu kaum yang berdzikir kepada Allah ﷻ dari shalat Shubuh hingga terbit matahari lebih aku sukai dari memerdekakan empat orang keturunan Ismail, dan sungguh aku duduk bersama suatu kaum yang berdzikir kepada Allah ﷻ dari Shalat Ashar hingga terbenam matahari lebih aku sukai dari memerdekakan empat (orang budak).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ ﴿ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾",
                "translation_id": "Allah, tidak ada Tuhan (yang berhak disembah), melainkan Dia yang hidup kekal, lagi terus menerus mengurus (makhluk-Nya). Tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang dilangit dan dibumi. Tiada yang dapat memberi syafa'at di sisi Allah tanpa seizin-Nya. Allah mengetahui apa-apa yang ada dihadapan mereka dan dibelakang mereka. Dan mereka tidak mengetahui apa-apa dari ilmu Allah, melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya. Dan Allah Maha Tinggi lagi Maha Besar.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "Siapa yang membacanya (surah Al Ikhlas, surah Al Falaq dan surah An Nas), tiga kali setiap pagi dan petang maka dicukup-kan baginya dari segala sesuatu.",
                "text": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِۚ ﴿ قُلْ هُوَ اللّٰهُ اَحَدٌۚ (١) اَللّٰهُ الصَّمَدُۚ (٢) لَمْ يَلِدْ وَلَمْ يُوْلَدْۙ (٣) وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ (٤) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ (١) مِنْ شَرِّ مَا خَلَقَۙ  (٢) وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ (٣) وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِۙ (٤) وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ (٥) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ (١) مَلِكِ النَّاسِۙ (٢) اِلٰهِ النَّاسِۙ (٣) مِنْ شَرِّ الْوَسْوَاسِ ەۙ الْخَنَّاسِۖ (٤) الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِۙ (٥) مِنَ الْجِنَّةِ وَالنَّاسِ (٦) ﴾ ثَلاَثَ مَرَّاتٍ",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ للهِ وَالْحَمْدُ ِللهِ لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلىَ كُلِّ شَيْءٍ قَدِيْرٍ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا اْليَوْمِ وَخَيْرَ مَا بَعْدَهُ وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَـرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوْءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فيِ النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
                "translation_id": "Kami telah memasuki waktu pagi, kerajaan milik Allah, segala puji bagi Allah. Tidak ada Tuhan yang berhak disembah selain Allah Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah yang Maha Kuasa atas segala sesuatu. Ya Tuhanku, aku mohon kepada-Mu kebaikan hari ini dan kebaikan sesudahnya. Aku berlindung kepada-Mu dari kejahatan hari ini dan kejahatan sesudahnya. Wahai Tuhan-ku, aku berlindung kepada-Mu dari kemalasan dan kejelekan di hari tua. Wahai Tuhanku, aku berlindung kepada-Mu dari siksaan di neraka dan siksaan di kubur.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "(Jika sore hari kalimat َأصَْبَح diganti أَمْسَى , kalimat اْلَيْوِم diganti اَّللْيَلِة)",
                "text": "اللَهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ النُّشُوْرُ",
                "translation_id": "Ya Allah, dengan rahmat dan pertolongan-Mu kami memasuki waktu pagi, dan dengan rahmat dan pertolongan-Mu kami memasuki waktu sore. Dengan rahmat dan pertolongan-Mu kami hidup dan dengan kehendak-Mu kami mati.  Dan kepada-Mu kebangkitan (bagi semua makhluk).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Pada sore hari membaca:",
                "post_text_id": "\"Siapa yang membacanya dengan yakin pada sore hari, kemudian dia meninggal, maka dia akan masuk syurga, demikian juga jika (dibaca) pada pagi hari.\"",
                "text": "اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أًصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوْتُ وَإِلَيْكَ الْمَصِيْرُ اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوْءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ",
                "translation_id": "Ya Allah, Engkau adalah Tuhanku, tiada Tuhan yang berhak disembah kecuali Engkau, Engkaulah yang menciptakan aku. Aku adalah hamba-Mu. Aku akan setia pada perjanjianku dengan-Mu semampuku. Aku berlindung kepada-Mu dari kejelekan yang aku perbuat. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku, oleh karena itu, ampunilah dosaku. Sesungguhnya tiada yang dapat mengampuni dosa kecuali Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "Dibaca empat kali di waktu pagi dan petang, jika sore hari diganti menjadi: اللَّهُمَّ إِنِّي أّمْسَيْتُ .\n \"Siapa yang membacanya setiap pagi dan petang sebanyak empat kali, Allah bebaskan dirinya dari api neraka.\"",
                "text": "اللَّهُمَّ إِنِّي أَصْبَحْتُ، أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ وَجَمِيْعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللًهُ لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُوْلُكَ. أَرْبَعَ مَرَّاتٍ",
                "translation_id": "Ya Allah, sesungguhnya aku di waktu pagi bersaksi kepada-Mu, malaikat yang memikul 'Arasy-Mu, malaikat-malaikat dan seluruh makhluk-Mu, sesungguhnya Engkau adalah Allah, tiada Tuhan yang berhak disembah kecuali Engkau Yang Maha Esa, tiada sekutu bagi-Mu dan sesungguhnya Muhammad adalah hamba dan utusan-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Barang siapa yang membacanya di pagi hari, maka sungguh ia telah bersyukur pada hari itu. Barang siapa yang membacanya di sore hari, maka ia sungguh telah bersyukur pada malam itu.\"",
                "text": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
                "translation_id": "Ya Allah, nikmat yang kuterima atau diterima oleh seseorang di antara makhluk-Mu di pagi ini adalah dari-Mu. Maha Esa Engkau, tiada sekutu bagi-Mu. Bagi-Mu segala puji dan kepada-Mu panjatan syukur (dari seluruh makhluk-Mu).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، الَّلهُمَّ عَافِني فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وَأَعُوْذُ بِكَ مـِنْ عَذَابِ الْقَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ (ثَلَاثَ مَرَّاتٍ).",
                "translation_id": "Ya Allah, selamatkan tubuh-ku (dari penyakit dan yang tidak aku inginkan). Ya Allah, selamatkan pendengaranku (dari penyakit dan maksiat atau sesuatu yang tidak aku inginkan). Ya Allah, selamatkan penglihatanku, tiada Tuhan (yang berhak disembah) kecuali Engkau. Ya Allah!, Sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kefakiran. Aku berlindung kepada-Mu dari siksa kubur, tiada Tuhan (yang berhak disembah) kecuali Engkau\". Dibaca tiga kali di waktu pagi dan petang.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "حَسْبِيَ اللهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ",
                "translation_id": "Cukup bagiku Allah (sebagai pelindung), tiada Tuhan (yang berhak disembah) kecuali Dia. Kepada-Nya aku bertawakkal dan Dia adalah Tuhan 'Arasy yang Agung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِيْنِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
                "translation_id": "Ya Allah, sesungguhnya aku mohon kepada-Mu ampunan dan keselamatan di dunia dan akhirat. Ya Allah sesungguhnya aku mohon kepada-Mu ampunan dan keselamatan: dalam agamaku, (kehidupan) duniaku, keluargaku, hartaku. Ya Allah tutuplah auratku (aib dan sesuatu yang tidak layak di lihat orang lain) dan berilah ketentraman di hatiku. Ya Allah, peliharalah aku dari arah depan, belakang, kanan, kiri dan atasku. Aku berlindung dengan kebesaran-Mu, agar aku tidak mendapat bahaya dari bawahku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
                "translation_id": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata. Wahai Tuhan Pencipta langit dan bumi, Tuhan segala sesuatu yang merajainya. Aku bersaksi bahwa tiada tuhan yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari kejahatan diriku, setan dan bala tentaranya, atau aku menjalankan kejelekan terhadap diriku atau mendorong orang Islam padanya",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي اْلأَرْضِ وَلاَ فِي السَّمَاءِ   وَهُوَ السَّمِيْعُ الْعَلِيْمُ (ثَلاَثَ مَرَّاتٍ).",
                "translation_id": "Dengan nama Allah yang bila disebut, segala sesuatu di bumi dan langit tidak akan berbahaya. Dialah Yang Maha Mengetahui.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 3 Kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Siapa yang membacanya tiga kali saat pagi dan petang tiga kali, maka Allah pasti akan meridhainya pada hari kiamat.\"",
                "text": "رَضِيْتُ بِاللهِ رَبـاًّ، وَبِاْلإِسْلاَمِ دِيْنـًا، وَبِمُحَمَّدٍ نَبِيـًّا ﷺ (ثَلاَثَ مَرَّاتٍ)",
                "translation_id": "Aku rela Allah sebagai Tuhan-(ku), Islam sebagai agama-(ku) dan Muhammad ﷺ sebagai nabi-(ku).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Diucapkan 3 Kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
                "translation_id": "Wahai Yang Maha Hidup dan Maha Terjaga, dengan rahmat-Mu aku minta pertolongan, perbaikilah segala urusanku dan jangan Engkau limpahkan (semua urusan) terhadap diriku walau sekejap mata.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَنُوْرَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَشَرِّ مَا بَعْدَهُ",
                "translation_id": "Kami di waktu pagi, sedang kerajaan milik Allah, Tuhan penguasa alam. Ya Allah, sesungguhnya aku mohon kepada-Mu agar memperoleh kebaikan, pembuka (rahmat) pertolongan, cahaya, berkah, dan petunjuk di hari ini. Aku berlindung kepada-Mu dari kejelekan apa yang ada didalamnya dan kejahatan sesudahnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَصْبَحْنَا عَلىَ فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ وَعَلىَ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
                "translation_id": "Diwaktu pagi kami memegang agama Islam, kalimat ikhlas, agama nabi kita, Muhammad ﷺ dan agama ayah kami, Ibrahim ﷷﷵ, yang berdiri di atas jalan yang lurus, muslim dan tidak tergolong orang-orang musyrik.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ (مــائة مرة).",
                "translation_id": "Maha Suci Allah dan segala puji (bagi-Nya).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 100 kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Dibaca sepuluh kali atau sekali saja saat malas\"",
                "text": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَـرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ (عَشْرَ مَرَّات أَوْ مَرَّةً وَاحِدَةً عِنْدَ الكَسَل ).",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ، وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ (مِائَةَ مَرَّةٍ إِذَا أَصْبَحَ).",
                "translation_id": "Siapa yang membacanya setiap hari seratus kali, maka dia bagaikan memerdekakan sepuluh budak, dan dicatat baginya seratus kebaikan, dihapus baginya seratus dosa, dan dia terpelihara dari setan hingga sore dan tidak ada seorangpun yang mendapatkan keutamaan seperti itu, kecuali seseorang yang mengamalkannya lebih banyak dari itu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 100 kali saat pagi)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ (ثَلاَثَ مَرَّاتٍ إِذَا أَصْبَحَ)",
                "translation_id": "Maha Suci Allah, aku memuji-Nya sebanyak makhluk-Nya, sejauh kerelaan-Nya, seberat timbangan 'Arasy-Nya dan sebanyak tinta tulisan kalimat-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 3 kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (إِذَا أَصْبَحَ).",
                "translation_id": "Ya Allah, sesungguhnya aku mohon kepada-Mu ilmu yang bermanfaat, rezki yang baik dan amal yang diterima.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca di pagi hari)"
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Dibaca seratus kali dalam sehari\"",
                "text": "اَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ (مِائَةَ مَرَّةٍ فِي اليَوْمِ).",
                "translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Siapa yang membacanya pada sore hari tiga kali maka dia tidak akan tertimpa demam pada malam itu.\"",
                "text": "أَعُوْذُ بِكَلِماَتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ (ثلاث مرات إذا أمسى).",
                "translation_id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan apa yang Dia ciptakan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Siapa yang bershalawat kepadaku saat pagi sepuluh kali, dan sore sepuluh kali, maka dia akan mendapatkan syafa'atku pada hari kiamat\"",
                "text": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ (عشر مرات).",
                "translation_id": "Ya Allah, (sampaikanlah) shalawat dan salam kepada Nabi kami Muhammad ﷺ.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 10 kali)"
            }
        ]
    },
    {
        "title_en": "Dhikr want to go to sleep",
        "title_id": "Dzikir menjelang tidur",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيْهِمَا فَيَقْرَأُ فِيْهِمَا : بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِۚ ﴿ قُلْ هُوَ اللّٰهُ اَحَدٌۚ (١) اَللّٰهُ الصَّمَدُۚ (٢) لَمْ يَلِدْ وَلَمْ يُوْلَدْۙ (٣) وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ (٤) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ (١) مِنْ شَرِّ مَا خَلَقَۙ  (٢) وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ (٣) وَمِنْ شَرِّ النَّفّٰثٰتِ فِى الْعُقَدِۙ (٤) وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ (٥) ﴾ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمٌِِۚ ﴿ قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ (١) مَلِكِ النَّاسِۙ (٢) اِلٰهِ النَّاسِۙ (٣) مِنْ شَرِّ الْوَسْوَاسِ ەۙ الْخَنَّاسِۖ (٤) الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِۙ (٥) مِنَ الْجِنَّةِ وَالنَّاسِ (٦) ﴾  ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِـهِ  وَماَ أَقْبَلَ مِنْ جَسَدِهِ،  يَفْعَلُ ذَلِكَ ثَلَاثَ مَرَّاتٍ ",
                "translation_id": "Kedua telapak tangannya disatukan lalu membaca: Surat Al Ikhlas, Al-Falaq dan An-Nas. Kemudian dengan dua tapak tangannya, beliau mengusap tubuh yang dapat dijangkau dengannya. Dimulai dari kepala, wajah dan tubuh bagian depan. Dilakukan sebanyak 3 kali.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                "translation_id": "Siapa yang membacanya (ayat Kursi) saat hendak tidur, maka sesungguhnya dia selalu berada dalam perlindungan Allah dan tidak didekati setan hingga pagi hari",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "\"Siapa yang membaca kedua ayat tersebut, maka keduanya akan mencukupinya\"",
                "text": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ ( ٢٨٥ )  لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ ( ٢٨٦ )",
                "translation_id": "Rasul telah beriman kepada Al Qur'an yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, dan rasul-rasul-Nya. (Mereka mengatakan): \"Kami tidak membeda-bedakan antara seorangpun (dengan yang lain) dari rasul-rasul-Nya\", dan mereka mengatakan: \"Kami dengar dan kami ta'at\". (Mereka berdo'a): \"Ampunilah kami ya Tuhan kami dan kepada Engkau-lah tempat kembali. Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat pahala (dari kebajikan) yang diusahakannya dan ia mendapat siksa (dari kejahatan) yang dikerjakannya. (Mereka berdoa): \"Ya Tuhan kami, janganlah Engkau hukum kami, jika kami lupa atau kami tersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang yang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya. Beri maaflah kami; ampunilah kami; dan rahmatilah kami. Engkaulah Penolong kami, maka tolonglah kami terhadap kaum yang kafir.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "QS. Al Baqarah: 285-286"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِيْنَ",
                "translation_id": "Dengan menyebut nama-Mu wahai Tuhanku, aku merebahkan tubuhku. Jika Engkau hendak menahan jiwaku (mencabut nyawaku) maka kasihanilah, dan jika Engkau biarkan (hidup) maka jagalah sebagaimana Engkau menjaga hamba-hamba-Mu yang shaleh.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْلَهَا، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ",
                "translation_id": "Ya Allah, Sesungguhnya Engkau menciptakan diriku, dan Engkaulah yang akan mematikannya. Mati dan hidupnya hanya milik-Mu. Apabila Engkau menghidupkannya, maka peliharalah ia. Apabila Engkau mematikannya, maka ampunilah ia. Ya Allah, sesungguhnya aku mohon kepada-Mu keselamatan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ (ثَلاَثَ مَرَّاتٍ)",
                "translation_id": "Ya Allah, lindungilah aku (dari) azab-Mu pada hari Engkau bangkitkan hamba-bamba-Mu",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 3 Kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
                "translation_id": "Dengan nama-Mu, ya Allah, aku mati dan hidup",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ اللهِ (ثلاثا وثلاثين) وَالْحَمْدُ للهِ (ثلاثا وثلاثين) وَاللهُ أَكْبَرُ (ثلاثا وثلاثين).",
                "translation_id": "Membaca Subhanallah 33x, AlHamdulillah 33x, Allahu Akbar 33x.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "\"Siapa yang membacanya saat hendak tidur, maka hal itu lebih baik baginya dari (memiliki) seorang pembantu.\""
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيْمِ، رَبَّنـَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَاْلإِنْجِيْلِ، وَالْفُرْقَانِ، أَعُوْذُ بِكَ مِنْ شَـرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ اْلأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وََأَنْتَ الْبَاطِنُ فَلَيْسَ دُوْنَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.",
                "translation_id": "Ya Allah, Tuhan yang menguasai langit yang tujuh, Tuhan yang menguasai Arasy yang agung, Tuhan kami dan Tuhan segala sesuatu, Tuhan yang membelah butir tumbuh-tumbuhan dan biji buah, Tuhan yang menurunkan kitab Taurat, Injil dan Furqan (Al Qur'an). Aku berlindung kepada-Mu dari kejahatan segala sesuatu yang Engkau memegang ubun-ubunnya. Ya Allah, Engkaulah yang pertama, sebelum-Mu tidak ada sesuatu. Engkaulah yang terakhir setelah-Mu tidak ada sesuatu. Engkaulah yang dzahir, diatas-Mu tidak ada sesuatu. Engkaulah yang batin, di bawah-Mu tidak ada sesuatu, lunasilah hutang kami dan berilah kami kekayaan hingga kami terlepas dari kefakiran",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَم مِمَّنْ لاَ كَافِيَ لَـهُ وَلاَ مُؤْوِيَ",
                "translation_id": "Segala puji hanya bagi Allah Yang telah memberi kami makan dan memberi kami minum, mencukupi kami, memberi kami tempat berteduh. Betapa banyak orang yang tidak memiliki siapa yang mencukupinya dan memberinya tempat berteduh.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوْءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
                "translation_id": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata. Wahai Tuhan Pencipta langit dan bumi, Tuhan segala sesuatu yang merajainya. Aku bersaksi bahwa tiada tuhan yang berhak disembah kecuali Engkau. Aku berlindung kepada-Mu dari kejahatan diriku, setan dan bala tentaranya, atau aku menjalankan kejelekan terhadap diriku atau mendorong orang Islam padanya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَقْرَأُ، تَنْزِيْل السَّجْدَةُ وَ ﴿ تَبٰرَكَ الَّذِيْ بِيَدِهِ الْمُلْك ﴾",
                "translation_id": "Membaca surah As-Sajadah dan Tabarak.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "Rasulullah ﷺ bersabda kepada orang yang membacanya menjelang tidur: \"Jika engkau meninggal, engkau meninggal dalam keadaan fitrah.\"",
                "text": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إلَيْكَ، وَفَوَّضْتُ أَمْرِيْ إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
                "translation_id": "Ya Allah, aku menyerahkan diriku kepada-Mu, aku menyerahkan urusanku kepada-Mu, aku menghadapkan wajahku kepada-Mu, aku merebahkan punggungku kepada-Mu. Karena senang (mendapat rahmat-Mu) dan takut pada (siksaan-Mu). Tidak ada tempat perlindungan dan penyelamatan dari (ancaman)-Mu, kecuali kepada-Mu. Aku beriman pada kitab yang telah Engkau turunkan (melalui malaikat) dan (kebenaran) nabi-Mu yang Engkau utus.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a if waking up at night",
        "title_id": "Do'a jika terbangun pada malam hari",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": "Do'a diatas dibaca jika membolak-balikkan tubuh pada malam hari",
                "text": "لاَ إِلَهَ إِلاَّ اللهُ الْوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَاْلأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيْزُ الْغَفَّارُ",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, Yang Maha Perkasa, Tuhan langit dan bumi dan di antara keduanya, yang Maha Mulia lagi Maha Pengampun.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when something is scary in sleep",
        "title_id": "Do'a apabila ada yang menakutkan dalam tidur",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَحْضُرُوْنَ",
                "translation_id": "Aku berlindung dengan kalimat Allah yang sempurna dari kemarahan, siksaan dan kejahatan hamba-hamba-Nya dan dari godaan setan serta jangan sampai setan mendatangiku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "What to do when a nightmare",
        "title_id": "Yang dilakukan bila mimpi buruk",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَنْفُثُ عَنْ يَسَارِهِ (ثلاثا).",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَسْتَعِيْذُ بِاللهِ مِنَ الشَّيْطَانِ وَمِنْ شَرِّ مَا رَأَى (ثلاث مرات).\nلاَ يُحَدِّثْ بِهَا أَحَداً\nيَتَحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ\nيَقُوْمُ يُصَلِّي إِنْ أَرَادَ ذَلِكَ.",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Lakukan hal-hal berikut:",
                "post_text_id": "Meniup (seperti meludah) tiga kali.\nBerlindung kepada Allah dari setan dan dari keburukan apa yang dia mimpikan.\nTidak menceritakannya kepada siapapun.\nMerubah posisinya dari yang semula.\nBangun dan shalat, jika dia menghendaki.",
                "text": null,
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a qunut witr",
        "title_id": "Do'a qunut witir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنِ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ، إِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ، (وَلاَ يَعِزُّ مَنْ عَادَيْتَ) تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ.",
                "translation_id": "Ya Allah, berilah aku petunjuk sebagaimana orang-orang yang Engkau beri petunjuk, berilah aku perlindungan (dari penyakit) sebagaimana orang yang telah Engkau lindungi, uruslah aku sebagaimana  orang yang telah Engkau urus. Berilah berkah apa yang Engkau berikan kepadaku, jauhkan aku dari kejelekan apa yang Engkau tetapkan. Sesungguhnya Engkau yang menjatuhkan qadha' (ketetapan), dan tidak ada orang yang memberikan hukuman kepada-Mu. Sesungguhnya orang yang Engkau cintai tidak akan hina dan orang yang Engkau musuhi tidak akan mulia. Maha Suci Engkau, wahai Tuhan kami dan Engkau Maha Tinggi.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنيِّ أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "translation_id": "Ya Allah, sesungguhnya aku berlindung dengan keridha'an-Mu dari kemurkaan-Mu, dan dengan keselamatan-Mu dan siksaan-Mu. Aku berlindung kepada-Mu dari ancaman-Mu. Aku tidak membatasi untuk memuji-Mu. Engkau adalah sebagaimana yang Engkau sanjungkan kepada diri-Mu sendiri.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِاْلكَافِرِيْنَ مُلْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلاَ نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ.",
                "translation_id": "Ya Allah, sesungguhnya kami menyembah-Mu, kepada-Mu kami shalat dan sujud, kepada-Mu kami berusaha dan melayani. Kami mengharapkan rahmat-Mu, kami takut akan siksa-Mu, sesungguhnya siksaan-Mu akan menimpa orang-orang yang kafir. Ya Allah, kami mohon pertolongan dan ampunan kepada-Mu. Kami memuji kebaikan-Mu, kami beriman kepada-Mu, kami tunduk (pada ajaran-Mu) dan kami berlepas diri dari orang-orang yang kufur kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Dhikr after salam shalat witr",
        "title_id": "Dzikir setelah salam shalat witir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ الْمَلِكِ الْقُدُّوْسِ رَبِّ الْمَلاَئِكَةِ وَالرُّوْحِ",
                "translation_id": "Maha suci (Engkau Ya Allah), Raja Yang Maha suci, Tuhan-nya para malaikat dan malaikat Jibril.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Dibaca tiga kali dan yang ketiganya dikeraskan serta dipanjangkan suaranya dengan berkata:",
                "post_text_id": null,
                "text": "رَبِّ الْمَلاَئِكَةِ وَالرُّوْحِ",
                "translation_id": "Tuhan-nya para malaikat dan malaikat Jibril.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when sad and grieving",
        "title_id": "Do'a saat gundah dan berduka",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِـيَّ حُكْمُكَ، عَدْلٌ فِـيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيْعَ قَلْبِي، وَنُوْرَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي.",
                "translation_id": "Ya Allah, sesungguhnya aku adalah hamba-Mu, anak dari hamba-Mu, ubun-ubunku (nasib-ku) ada di tangan-Mu, telah lalu hukum-Mu atasku, adil ketetapan-Mu atasku, aku mohon kepada-Mu dengan perantara semua nama milik-Mu yang Engkau namakan sendiri, atau Engkau turunkan dalam kitab-Mu, atau Engkau ajarkan seseorang dari hamba-Mu, atau Engkau rahasiakan dalam ilmu ghaib disisi-Mu. Jadikanlah Al Qur'an sebagai penawar hatiku, cahaya dalam dadaku, penghapus dukaku dan pengusir keluh kesahku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ.",
                "translation_id": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari keluh kesah dan rasa sedih, dari kelemahan dan kemalasan, dari sifat bakhil dan penakut, dari cengkraman utang dan laki-laki yang menindas-(ku).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for deep sorrow",
        "title_id": "Do'a untuk kesedihan yang mendalam",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ الْعَظِيْمُ الْحَلِيْمُ،  لاَ إِلَهَ إِلاَّ اللهُ رَبُّ الْعَرْشِ الْعَظِيْمِ، لاَ إِلَهَ إِلاَّ اللهُ رَبُّ السَّمَوَاتِ وَرَبُّ اْلأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Agung dan Maha Lembut, Tiada Tuhan yang berhak disembah selain Allah, Tuhan 'Arasy yang agung. Tiada Tuhan yang berhak disembah selain Allah, Tuhan langit dan bumi dan Tuhan 'Arasy yang mulia.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِيْ شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ",
                "translation_id": "Ya Allah, rahmat-Mu aku harapkan, janganlah Engkau serahkan (segala urusanku) kepada diriku walau sekejap mata, perbaikilah segala urusanku, tiada Tuhan yang berhak disembah selain Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Maha suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang dzalim.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُ اللهُ رَبِّي لاَ أُشْرِكُ بِهِ شَيْئاً",
                "translation_id": "Allah, Allah adalah Tuhan-ku, aku sedikitpun tidak menyekutukan-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a  when meeting enemies and rulers",
        "title_id": "Do'a saat bertemu musuh dan penguasa",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُوْرِهِمْ وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ.",
                "translation_id": "Ya Allah, sesungguhnya aku menjadikan Engkau di leher mereka (agar kekuatan mereka tidak berdaya) dan aku berlindung dari keburukan mereka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَجُوْلُ، وَبِكَ أَصُوْلُ، وَبِكَ أُقَاتِلُ.",
                "translation_id": "Ya Allah, Engkau adalah lenganku (pertolongan-Mu yang ku-utamakan dalam menghadapi lawanku). Engkau adalah Pembela-ku. Dengan pertolongan-Mu aku berputar-putar, dengan pertolongan-Mu aku menyergap dan dengan pertolongan-Mu aku berperang.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيْلُ",
                "translation_id": "Cukup bagi kami Allah sebaik-baik pelindung.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when fear facing the dzalim rulers",
        "title_id": "Do'a saat takut menghadapi penguasa dzalim",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلاَنِ بْنِ فُلاَنٍ، وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلاَ إِلَهَ إِلاَّ أَنْتَ.",
                "translation_id": "Ya Allah, Tuhan langit dan bumi, Tuhan 'Arasy yang agung, jadilah pendampingku dari fulan bin fulan dan kelompoknya dari makhluk-Mu, (agar) tidak ada seorangpun dari mereka berlaku sewenang-wenang terhadapku atau melampaui batas, pembelaan-Mu amatlah besar, pujian terhadap-Mu amatlah agung, dan tiada Tuhan yang berhak disembah selain Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعاً، ألله أَعَزَّ مِمَّا أَخَافُ وَأَحْذَرُ، أَعُوْذُ بِاللهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى اْلأَرْضِ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وَجُنُوْدِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ، مِنَ الْجِنِّ وَاْلإِنْسِ، اللَّهُمَّ كُنْ لِيْ جَاراً مِـنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ (ثلاث مرات).",
                "translation_id": "Allah Maha besar, Allah lebih mulia dari seluruh makhluk-Nya, Allah lebih mulia dari apa yang aku takuti, aku berindung kepada Allah yang tiada Tuhan yang berhak disembah selain Dia, Yang mengendalikan tujuh langit hingga tidak runtuh ke bumi kecuali denga izin-Nya dari kejahatan hamba-Mu fulan dan bala tentaranya serta pendukung-pendukungnya dari golongan jin dan manusia. Ya Allah, jadilah pendampingku terjauhkan dari keburukan mereka, pujian terhadap-Mu amatlah agung, perlindungan-Mu amatlah besar, Maha suci nama-Mu dan tiada Tuhan yang berhak disembah selain diri-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for the enemies",
        "title_id": "Do'a atas musuh",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ اْلأَحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ",
                "translation_id": "Ya Allah yang menurunkan kitab, Maha cepat perhitungan-Nya, hancurkanlah pasukan-pasukan (musuh), Ya Allah kalahkanlah mereka dan goyahkanlah mereka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when fear from peoples / group",
        "title_id": "Do'a saat takut terhadap suatu kaum/kelompok",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
                "translation_id": "Ya Allah, lindungilah aku dari mereka dengan apa yang Engkau kehendaki.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for those who are in doubt in faith",
        "title_id": "Do'a bagi yang mengalami  keraguan dalam iman",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَسْتَعِيْذُ بِاللهِ ويَنْتَهِي عَمَّا شَكَّ فِيْهِ.",
                "translation_id": "Berlindung kepada Allah ﷻ. Maka akan berhenti dari keraguannya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَقُوْلُ: آمَنْتُ بِاللهِ وَرُسُلِهِ.",
                "translation_id": "Aku beriman kepada Allah dan para Rasul-Nya",
                "inline_pre_translation_id": "Membaca: ",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يَقْرَأُ قَوْلَهُ تَعَالَى: ﴿ هُوَ ٱلْأَوَّلُ وَٱلْءَاخِرُ وَٱلظَّٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ. ﴾",
                "translation_id": "Dialah Yang awal dan Dialah yang akhir, Dialah Yang nyata dan Dialah yang tersembunyi, dan Dia mengetahui terhadap segala sesuatu.",
                "inline_pre_translation_id": "Membaca firman Allah ﷻ :",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for being able to pay off the debt",
        "title_id": "Do'a agar dapat melunasi hutang",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِني بِفَضْلِكَ عَمَّنْ سِـوَاكَ.",
                "translation_id": "Ya Allah, cukupilah aku dengan (rezeki)-Mu yang halal (hingga aku terhindar) dari yang haram. Kayakanlah aku dengan kenikmatan-Mu selain-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُم إِنِّي أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ.",
                "translation_id": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari keluh kesah dan kesedihan, dari kelemahan dan kemalasan, dari sifat bakhil dan penakut, dari cengkraman hutang dan laki-laki yang menindas-(ku).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a in doubt in shalat and reading",
        "title_id": "Do'a saat ragu dalam shalat dan bacaannya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِاللهِ مِنَ الشَّيْـــطَانِ الرَّجِيْمِ ( وَاتْفُلْ عَلَى يَسَارِكَ ثلاثا )",
                "translation_id": "Aku berlindung kepada Allah dari setan yang terkutuk.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a of people who have difficulty",
        "title_id": "Do'a orang yang mengalami kesulitan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً.",
                "translation_id": "Ya Allah, tidak ada yang mudah kecuali apa yang Engkau mudahkan dan tidak ada yang sulit jika Engkau menghendakinya kemudahan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Speech of a sinner",
        "title_id": "Ucapan orang yang melakukan dosa",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُوْرَ، ثُمَّ يَقُوْمُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُ اللهَ إِلاَّ غَفَرَ اللهُ لَهُ.",
                "translation_id": "Setiap hamba yang melakukan perbuatan dosa, kemudian dia bersuci, lalu shalat dua raka'at, kemudian dia beristighfar, niscaya Allah mengampuni dosanya",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a cast out demons and their whispers",
        "title_id": "Do'a mengusir setan dan bisikannya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الاِسْتِعَاذَةُ بِاللهِ مِنْهُ",
                "translation_id": null,
                "inline_pre_translation_id": "Berlindung kepada Allah darinya dengan mengucapkan: \"A'udzubillahi minasyyaitanir rajiim\"",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الآذَانُ.",
                "translation_id": "",
                "inline_pre_translation_id": "Mengumandangkan adzan.",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": "Termasuk yang dapat mengusir setan adalah dzikir pagi dan petang, dzikir saat hendak dan bangun tidur, dzikir masuk dan keluar rumah, dzikir masuk dan keluar masjid, dan dzikir lainnya yang disyari'atkan. Seperti; membaca ayat kursi saat hendak tidur, membaca dua ayat terakhir surah Al Baqarah dan lain-lain.",
                "text": "الأَذْكَارُ وَقِرَاءَةُ الْقُرْآنِ.",
                "translation_id": "Jangan jadikan rumahmu sebagai kuburan, sesungguhnya setan lari dari rumah yang didalamnya dibacakan surah Al Baqarah.",
                "inline_pre_translation_id": "Melakukan dzikir dan membaca Al Qur'an",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when experiencing something you don't want",
        "title_id": "Do'a saat mengalami sesuatu yang tidak diinginkan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": "\"Mu'min yang kuat lebih baik dan lebih dicintai oleh Allah dari mu'min yang lemah dan semuanya baik. Berusahalah untuk meraih apa yang bermanfaat bagimu, mintalah pertolongan kepada Allah dan jangan lemah, jika menimpamu sesuatu hal, jangan katakan seandainya aku lakukan ini dan itu, akan tetapi katakanlah: \"Allah telah mentaqdirkannya dan apa yang Dia kehendaki Dia lakukan\", karena ucapan \"seandainya\"  akan membuka (memberi peluang bagi) perbuatan setan\"",
                "text": "قَدَّرَ اللهُ وَماَ شَاءَ فَعَلَ.",
                "translation_id": "Allah telah mentaqdirkannya dan apa yang Dia kehendaki Dia lakukan",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Greetings for the person who gets the birth and the answer",
        "title_id": "Ucapan bagi orang yang mendapatkan kelahiran dan jawabannya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوْبِ لَكَ، وَشَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ.",
                "translation_id": "Semoga Allah memberkahi-mu atas pemberiannya kepadamu, engkau layak bersyukur, (semoga) anakmu cepat dewasa dan engkau diberi rezki berupa baktinya kepadamu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Bagi yang diberi ucapan selamat, ia membalasnya dengan mengucapkan:",
                "post_text_id": null,
                "text": "بَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَزَاكَ اللهُ خَيْرًا، وَرَزَقَكَ اللهُ مِثْلَهُ، وَأَجْزَلَ ثَوَابَكَ",
                "translation_id": "Semoga Allah memberkahimu dan membalasmu dengan kebaikan dan engkau diberi rezki seperti itu danbalasanmu dilipatgandakan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a protection for children",
        "title_id": "Do'a perlindungan bagi anak",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "كَانَ رَسُوْلُ اللهِ ﷺ يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنِ: أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ.",
                "translation_id": "Aku berlindung kepada Allah untukmu berdua dengan kalimat-kalimat Allah yang sempurna, dari setan, binatang yang berbisa dan 'ain  yang menimpanya",
                "inline_pre_translation_id": "Adalah Rasulullah ﷺ berdo'a untuk perlindungan Hasan dan Husain, beliau berkata:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for sick person",
        "title_id": "Do'a kepada orang sakit",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ بَأْسَ طَهُوْرٌ إِنْ شَاءَ اللهُ",
                "translation_id": "Tidak mengapa, semoga sakitmu ini membuat dosamu bersih, Insya Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َسْأَلُ اللهَ الْعَظِيْمَ رَبَّ الْعَرْشِ الْعَظِيْمِ أَنْ يَشْفِيَكَ (سَبْعَ مَرَّاتٍ).",
                "translation_id": "Aku mohon kepada Allah yang Maha Mulia pemilik 'Arasy Yang Agung, agar Dia menyembuhkanmu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(Dibaca 7 kali)"
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": "Setiap hamba muslim yang mengunjungi orang sakit, yang belum datang ajalnya kemudian dia membaca: (do'a di atas) tujuh kali, maka (orang yang sakit tersebut) akan disembuhkan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The preference of visiting the sick person",
        "title_id": "Keutamaan mengunjungi orang sakit",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ: إِذاَ عاَدَ الرَّجُلُ أَخَاهُ الْمُسْلِمَ مَشَى فِي خِرَافَةِ الْجَنَّةِ حَتَّى يَجْلِسَ فَإِذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ، فَإِنْ كَانَ غُدْوَةً صَلىَّ عَلَيْهِ سَبْعُوْنَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ، وَإِنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُوْنَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ. ",
                "translation_id": "Jika seseorang berkunjung kepada saudaranya yang muslim (yang sedang menderita sakit), maka seakan-akan dia berjalan-jalan di syurga hingga duduk. Apabila sudah duduk, maka dituruni rahmat dengan deras. Apabila dia berkunjung di pagi hari maka tujuh puluh ribu malaikat mendo'akan-nya agar mendapat rahmat hingga sore hari. Apabila dia berkunjung di sore hari, maka tujuh puluh ribu malaikat mendo'akannya agar diberi rahmat hingga pagi hari.",
                "inline_pre_translation_id": "Beliau (Rasulullah ﷺ) bersabda:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a sick people who cannot recover",
        "title_id": "Do'a orang sakit yang tidak bisa sembuh",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِـــي وَأَلْحِقْنِي بِالرَّفِيْقِ اْلأَعْلَى.",
                "translation_id": "Ya Allah, ampunilah dosaku, berilah rahmat kepadaku dan pertemukan aku dengan teman yang tinggi derajatnya (para nabi dan orang shaleh).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "جَعَلَ النَّبِيُّ عِنْدَ مَوْتِهِ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ فَيَمْسَحُ بِهِمَا وَجْهَهُ وَيَقُوْلُ: لاَ إِلَهَ إِلاَّ اللهُ إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ.",
                "translation_id": "Rasulullah saat akhir hayatnya memasukkan kedua tangannya ke dalam air, lalu mengusapkan ke wajahnya seraya berkata: \"Tiada Tuhan yang berhak disembah selain Allah, sesungguhnya setiap kematian ada sekaratnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ، لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ، لاَ إِلَهَ إلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لاَ إِلَهَ إِلاَّ اللهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، لاَ إِلَهَ إِلاَّ اللهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ باِللهِ.",
                "translation_id": "Tiada Tuhan yang berhak selain Allah, Allah Maha Besar. Tidak ada Tuhan yang berhak disembah selain Allah yang Maha Esa, tidak ada Tuhan yang berhak disembah selain Allah Yang Maha Esa, tidak ada sekutu bagi-Nya, tiada Tuhan yang berhak disembah selain Allah, bagi-Nya kerajaan dan bagi-Nya pujian. Tidak ada Tuhan yang berhak disembah selain Allah, tidak ada daya dan kekuatan, kecuali dengan pertolongan Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Guiding (talqin) the dying",
        "title_id": "Membimbing (talqin) orang yang sekarat",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَنْ كَانَ آخِرُ كَلاَمِهِ: لاَ إِلَهَ إِلاَّ اللهُ دَخَلَ الْجَنَّةَ.",
                "translation_id": "Laa Ilaaha Illallah\" dia akan masuk syurga.",
                "inline_pre_translation_id": "Siapa yang akhir ucapannya:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when a current happens",
        "title_id": "Do'a saat terkena musibah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ اللَّهُمَّ أْجُرْنِي فِي مُصِيْبَتِي وَأَخْلِفْ لِي خَيْراً مِنْهَا",
                "translation_id": "Sesungguhnya kita milik Allah, dan kita akan kembali kepada-Nya. Ya Allah, berilah aku pahala atas musibah yang menimpaku dan gantilah untukku dengan yang lebih baik darinya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when closing the eyes of the corpse",
        "title_id": "Do'a saat memejamkan mata mayat",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اغْفِرْ لِفُلاَنِ: (sebutnamanya) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّيْنَ، وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِيْنَ، وَافْسَحْ لَه فيِ قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ.",
                "translation_id": "Ya Allah, ampunilah fulan (sebut namanya), angkatlah derajatnya bersama orang-orang yang mendapat petunjuk. Hendaklah Engkau menjadi pengganti untuk anak turunannya (peliharalah mereka). Ampunilah kami dan dia wahai Tuhan Penguasa alam. Luaskan baginya dalam kuburannya dan berilah penerangan di dalamnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a in Shalat Jenazah",
        "title_id": "Do'a dalam Shalat Jenazah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ اْلأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ (وَعَذَابِ النَّارِ).",
                "translation_id": "Ya Allah, ampunilah dia (mayat), berilah rahmat kepadanya, selamatkan dia, ampunilah dan tempatkanlah dia di tempat yang mulia, luaskan kuburannya, mandikan dia dengan air, salju dan es. Bersihkan dia dari kesalahan-kesalahannya, sebagaimana Engkau membersihkan baju putih dari kotoran, berilah rumah yang lebih baik daripada rumahnya, berilah keluarga (atau istri di syurga) yang lebih baik daripada keluarganya (di dunia), istri (atau suami) yang lebih baik daripada istrinya (atau suaminya di dunia), dan masukkanlah dia ke syurga, jagalah dia dari siksa kubur dan neraka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغاَئِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى اْلإِسْلاَمِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى اْلإِيْمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تُضِلَّنَا بَعْدَهُ.",
                "translation_id": "Ya Allah, ampunilah orang yang hidup di antara kami dan yang mati, orang yang hadir di antara kami dan yang tidak hadir, laki-laki maupun perempuan. Ya Allah, Orang yang Engkau hidupkan di antara kami, hidupkanlah ia dengan memegang ajaran Islam, dan orang yang Engkau matikan di antara kami, maka matikan ia dengan memegang keimanan. Ya Allah, jangan Engkau menghalangi kami untuk  memperoleh pahalanya dan janganlah Engkau sesatkan kami sepeninggalnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ فُلاَنٌ بْنِ فُلاَنٍ فِي ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ. فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ.",
                "translation_id": "Ya Allah, sesungguhnya fulan bin fulan dalam tanggungan-Mu dan tali perlindungan-Mu. Peliharalah dia dari fitnah kubur dan siksa neraka. Engkau adalah Maha Setia dan Maha Benar. Ampunilah dan kasihanilah dia. Sesungguhnya Engkau Dzat Yang Maha Pengampun lagi Maha Penyayang.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ.",
                "translation_id": "Ya Allah, (mayat ini) adalah hamba-Mu, anak dari hamba-Mu, dia membutuhkan rahmat-Mu, Engkau tidak membutuhkan untuk menyiksanya. Apabila dia baik, tambahkanlah kebaikannya, dan apabila dia jahat, maka ampunilah dosanya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for the corpse of children",
        "title_id": "Do'a untuk mayat anak kecil",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ",
                "translation_id": "Ya Allah, lindungilah dia dari azab kubur.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Baik juga jika ditambahkan dengan membaca do'a berikut ini:",
                "post_text_id": null,
                "text": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوَالِدَيْهِ، وَشَفِيْعاً مُجَاباً. اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا وَأَعْظِمْ بِهِ أُجُوْرَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِيْنَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لِأَسْلاَفِنَا وَأَفْرَاطِنَا وَمَنْ سَبَقَنَا بِالإِيْمَانِ.",
                "translation_id": "Ya Allah, jadikanlah kematian anak ini sebagai pahala dan simpanan bagi kedua orang tuanya dan pemberi syafa'at yang dikabulkan do'anya. Ya Allah, dengan musibah ini, beratkanlah timbangan amal keduanya (orang tuanya) dan berilah pahala yang agung. Anak ini kumpulkan dengan orang-orang yang shaleh dan jadikanlah dia dipelihara oleh Nabi Ibrahim. Peliharalah dia dengan rahmat-Mu dari siksaan neraka jahim.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اجْعَلْْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْرًاً.",
                "translation_id": "Ya Allah, jadikanlah kematian anak ini sebagai simpanan pahala dan amal baik bagi kami.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a Ta'ziah",
        "title_id": "Do'a ta'ziah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّى…فَلْتَصْبِرْ وَلْتَحْتَسِبْ.",
                "translation_id": "Sesungguhnya bagi Allah apa yang Dia ambil dan baginya pula apa yang Dia berikan. Segala sesuatu baginya ada memiliki masa-masa yang telah ditetapkan, hendaklah kamu bersabar dan mohon pahala (dari Allah).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Baik juga jika ditambah dengan ucapan berikut:",
                "post_text_id": null,
                "text": "أَعْظَمَ اللهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ وَغَفَرَ لِمَيِّتِكَ.",
                "translation_id": "Semoga Allah memperbesar pahalamu, dan kamu bisa berkabung dengan baik serta mayatnya diampuni oleh Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a reading when entering the body into the grave hole",
        "title_id": "Do'a saat memasukkan mayat ke liang kubur",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ وَعَلَى سُنَّةِ رَسُوْلِ اللهِ",
                "translation_id": "Dengan menyebut nama Allah dan dengan atas sunnah Rasulullah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a after corpse buried",
        "title_id": "Do'a setelah mayat dimakamkan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ.",
                "translation_id": "Ya Allah, ampunilah dia dan teguhkanlah dia.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a grave pilgrimage",
        "title_id": "Do'a Ziarah Kubur",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ الْمُؤْمِنِيْنَ وَالْمُسْلِمِيْنَ، وَإِناَّ إِنْ شَاءَ اللهُ بِكُمْ لاَحِقُوْنَ ( وَيَرْحَمُ اللهُ الْمُسْتَقْدِمِيْنَ مِنَّا وَالْمُسْتَأْخِرِيْنَ) أَسْأَلُ اللهَ لَنَا وَلَكُمْ الْعَافِيَةَ.",
                "translation_id": "Semoga kesejahteraan untukmu, wahai penghuni kubur dari orang-orang mu'min dan muslim, dan sesungguhnya kami Insya Allah akan menyusul kalian (Semoga Allah merahmati orang yang mendahului diantara kita dan mereka yang menyusul kemudian). Aku memohon kepada Allah untuk kami dan kalian keselamatan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when there are windstorm",
        "title_id": "Do'a apabila ada angin ribut",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا.",
                "translation_id": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikannya dan aku berlindung kepada-Mu dari keburukannya",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ ماَ فِيْهَا، وَخَيْرَ ماَ أُرْسِلَتْ بِهِ وَأَعُوْذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ.",
                "translation_id": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikannya, kebaikan apa yang terdapat padanya, kebaikan apa yang dibawanya dan aku berlindung kepada-Mu dari keburukannya, keburukan yang ada padanya dan keburukan yang dibawanya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when hearing lightning",
        "title_id": "Do'a saat mendengar petir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَمَلاَئِكَتُهُ مِنْ خِيْفَتِهِ.",
                "translation_id": "Maha suci Allah yang petir bertasbih dengan memuji-Nya dan begitu juga para malaikat, karena takut kepada-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to get rain",
        "title_id": "Do'a untuk minta hujan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ أَسْقِنَا غَيْثًا مُغِيْثًا مَرِيْئًا مَرِيْعًا، نَافِعًا غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ.",
                "translation_id": "Ya Allah! Berilah kami hujan yang merata, menyegarkan tubuh dan menyuburkan tanaman, bermanfaat, tidak membahayakan. Kami mohon hujan secepatnya, tidak ditunda-tunda.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ أَغِثْنَا، اَللَّهُمَّ أَغِثْنَا، اَللَّهُمَّ أَغِثْنَا.",
                "translation_id": "Ya Allah! Berilah kami hujan. Ya Allah, turunkan hujan pada kami. Ya Allah! Hujanilah kami.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ اسْقِ عِبَادَكَ وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِ بَلَدَكَ الْمَيِّتَ.",
                "translation_id": "Ya Allah! Berilah hujan kepada hamba-hamba-Mu, hewan ternak, berilah rahmat-Mu dengan merata, dan suburkan bumi-Mu yang tandus.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when it rains",
        "title_id": "Do'a apabila hujan turun",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ صَيِّبًا نَافِعًا.",
                "translation_id": "Ya Allah! Turunkanlah hujan yang bermanfaat.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a after the rain down",
        "title_id": "Do'a setelah hujan turun",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ.",
                "translation_id": "Kita diberi hujan karena karunia dan rahmat Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for the rain to stop",
        "title_id": "Do'a agar hujan berhenti",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اَللَّهُمَّ عَلَى اْلآكَامِ وَالظِّرَابِ، وَبُطُوْنِ اْلأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ.",
                "translation_id": "Ya Allah! Hujanilah di sekitar kami, jangan kepada kami. Ya, Allah! Berilah hujan ke daratan tinggi, beberapa anak bukit dasar lembah dan beberapa tanah yang menumbuhkan pepohonan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when looking at the crescent moon",
        "title_id": "Do'a saat melihat bulan sabit",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُ أَكْبَرُ، اَللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِاْلأَمْنِ وَاْلإِيْمَانِ، وَالسَّلاَمَةِ وَاْلإِسْلاَمِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ.",
                "translation_id": "Allah Maha Besar. Ya Allah! Tampakkan awal bulan itu kepada kami dengan membawa keamanan dan keimanan, keselamatan dan Islam serta mendapat taufik untuk menjalankan apa yang Engkau sukai dan ridha'i. Tuhan kami dan Tuhanmu (wahai bulan sabit) adalah Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when breaking the fast for people who are fasting",
        "title_id": "Do'a ketika berbuka bagi orang yang berpuasa",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوْقُ وَثَبَتَ اْلأَجْرُ إِنْ شَاءَ اللهُ.",
                "translation_id": "Telah hilang rasa haus, dan urat-urat telah basah serta pahala akan tetap, insya Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ بِرَحْمَتِكَ الَّتِيْ وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِيْ.",
                "translation_id": "Ya Allah!, Sesungguhnya aku me-mohon kepada-Mu dengan rahmat-Mu yang meliputi segala sesuatu, supaya memberi ampunan atasku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a before eating",
        "title_id": "Do'a Sebelum Makan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "",
                "translation_id": "Apabila seseorang di antara kamu hendak makan, bacalah:",
                "inline_pre_translation_id": "Rasulullah ﷺ  bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ",
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Apabila lupa pada permulaannya, bacalah:",
                "post_text_id": null,
                "text": "بِسْمِ اللهِ فِيْ أَوَّلِهِ وَآخِرِهِ.",
                "translation_id": "Dengan menyebut nama Allah, pada awalnya dan akhirnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Rasulullah ﷺ bersabda:",
                "post_text_id": null,
                "text": null,
                "translation_id": "Barangsiapa yang diberi rezeki oleh Allah berupa makanan, hendaklah membaca:",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": "Barangsiapa yang diberi rezeki oleh Allah berupa makanan, hendaklah membaca:",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ بَارِكْ لَنَا فِيْهِ وَأَطْعِمْنَا خَيْرًا مِنْهُ.",
                "translation_id": "Ya Allah! Berilah kami berkah dengan makan itu dan berilah makanan yang lebih baik.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Apabila diberi rezeki berupa minuman susu, hendaklah membaca:",
                "post_text_id": null,
                "text": "َللَّهُمَّ بَارِكْ لَنَا فِيْهِ وَزِدْنَا مِنْهُ.",
                "translation_id": "Ya Allah! Berilah kami berkah padanya dan tambahkanlah kepada kami (berkah) darinya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a after eating",
        "title_id": "Do'a setelah makan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ الَّذِيْ أَطْعَمَنِيْ هَذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِنِّيْ وَلاَ قُوَّةٍ.",
                "translation_id": "Segala puji bagi Allah Yang memberi makan ini kepadaku dan Yang memberi rezeki kepadaku tanpa daya dan kekuatanku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيْرًا طَيِّبًا مُبَارَكًا فِيْهِ، غَيْرَ (مُكْفِيٍّ وَلاَ) مُوَدَّعٍ، وَلاَ مُسْتَغْنًى عَنْهُ رَبَّنَا.",
                "translation_id": "Segala puji bagi Allah (aku memuji-Nya) dengan pujian yang banyak, yang baik dan penuh berkah, yang senantiasa dibutuhkan, diperlukan dan tidak bisa ditinggalkan, ya Tuhan kami.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a from guest for people who serving the foods",
        "title_id": "Do'a tamu kepada orang yang menghidangkan makanan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ.",
                "translation_id": "Ya Allah! Berilah berkah apa yang Engkau rezekikan kepada mereka, ampunilah dan belas kasihanilah mereka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for people who gave the drinks",
        "title_id": "Do'a untuk orang yang memberi minuman",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِيْ وَاسْقِ مَنْ سَقَانِيْ.",
                "translation_id": "Ya Allah! Berilah makan orang yang memberiku makan dan berilah minuman orang yang memberiku minuman.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when break the fasting on other people home",
        "title_id": "Do'a apabila berbuka di rumah orang lain",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُوْنَ، وَأَكَلَ طَعَامَكُمُ اْلأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ.",
                "translation_id": "Semoga orang-orang yang berpuasa berbuka di sisimu dan orang-orang yang baik makan makananmu, serta malaikat mendo'akan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a people who fast together are invited to eat",
        "title_id": "Do'a orang yang berpuasa apabila diajak makan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ، فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ.",
                "translation_id": "Apabila seseorang di antara kamu diundang (makan) dipenuhilah. Apabila puasa, hendaklah mendo'akan (orang yang mengundang). Apabila tidak puasa, hendaklah ia makan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Sayings of people who wish to be insulted",
        "title_id": "Ucapan orang yang berpuasa bila dihina",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِنِّيْ صَائِمٌ، إِنِّيْ صَائِمٌ.",
                "translation_id": "Sesungguhnya aku sedang berpuasa. Sesungguhnya aku sedang berpuasa.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when seeing the beginning of the fruit",
        "title_id": "Do'a apabila melihat permulaan buah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ بَارِكْ لَنَا فِيْ ثَمَرِنَا، بَارِكْ لَنَا فِيْ مَدِيْنَتِنَا، بَارِكْ لَنَا فِيْ صَاعِنَا، بَارِكْ لَنَا فِيْ مُدِّنَا.",
                "translation_id": "Ya Allah! Berilah berkah buah-buahan kami, berilah berkah kota kami, berilah berkah gantangan kami dan berilah berkah mud kami.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when sneezing",
        "title_id": "Do'a ketika bersin",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "",
                "translation_id": "Apabila seseorang di antara kamu bersin, hendaklah mengucapkan:",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ",
                "translation_id": "Segala puji bagi Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Lantas saudara atau temannya mengucapkan:",
                "post_text_id": null,
                "text": "يَرْحَمُكَ اللهُ",
                "translation_id": "Semoga Allah memberi rahmat kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Bila teman atau saudaranya mengucapkan demikian, bacalah:",
                "post_text_id": null,
                "text": "يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ.",
                "translation_id": "Semoga Allah memberi petunjuk kepadamu dan memperbaiki keadaanmu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading when disbelievers sneeze then praise Allah",
        "title_id": "Bacaan apabila orang kafir bersin kemudian memuji Allah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ.",
                "translation_id": "Semoga Allah memberi hidayah kepadamu dan memperbaiki hatimu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for bridal",
        "title_id": "Do'a kepada pengantin",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِيْ خَيْرٍ.",
                "translation_id": "Semoga Allah memberi berkah kepadamu dan atasmu serta mengumpulkan kamu berdua (pengantin laki-laki dan perempuan) dalam kebaikan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a of bridal for himself",
        "title_id": "Do'a pengantin kepada dirinya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Apabila seseorang di antara kamu menikahi seorang perempuan atau membeli budak, hendaklah mengucapkan:",
                "post_text_id": "Apabila membeli unta, hendaklah memegang puncak punuknya, lalu mengucapkan seperti itu.",
                "text": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ.",
                "translation_id": "Ya Allah! Sesungguhnya aku mohon kepada-Mu kebaikan perempuan atau budak ini dan apa yang telah Engkau ciptakan dalam wataknya. Dan aku mohon perlindungan kepada-Mu dari kejelekan perempuan atau budak ini dan apa yang telah Engkau ciptakan dalam wataknya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a before intercourse",
        "title_id": "Do'a sebelum bersetubuh",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ اَللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا.",
                "translation_id": "Dengan Nama Allah, Ya Allah! Jauhkan kami dari setan, dan jauhkan setan untuk mengganggu apa yang Engkau rezekikan kepada kami.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when angry",
        "title_id": "Do'a ketika marah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ.",
                "translation_id": "Aku berlindung kepada Allah dari godaan setan yang terkutuk.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a see other people getting into life problems",
        "title_id": "Do'a apabila melihat orang yang mengalami cobaan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِيْ مِمَّا ابْتَلاَكَ بِهِ وَفَضَّلَنِيْ عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً.",
                "translation_id": "Segala puji bagi Allah Yang menyelamatkan aku dari sesuatu yang Allah memberi cobaan kepadamu. Dan Allah telah memberi kemuliaan kepadaku, melebihi orang banyak.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading when in majelis",
        "title_id": "Bacaan dalam majelis",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Dari Ibnu Umar R.A katanya: adalah pernah dihitung bacaan Rasulullah ﷺ dalam satu majlis seratus kali sebelum beliau berdiri, yaitu:",
                "post_text_id": null,
                "text": "رَبِّ اغْفِرْ لِيْ وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُوْرُ.",
                "translation_id": "Wahai Tuhanku! Ampunilah aku dan terimalah taubatku, sesungguhnya Engkau Maha Menerima taubat lagi Maha Pengampun.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a majelis sin reducer",
        "title_id": "Do'a pelebur dosa majelis",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
                "translation_id": "Maha Suci Engkau, ya Allah, aku memuji-Mu. Aku bersaksi bahwa tiada Tuhan yang berhak disembah kecuali Engkau, aku minta ampun dan bertaubat kepada-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to the people who say: (GHAFARALLAAHU LAKA)",
        "title_id": "Do'a kepada orang yang berkata: (GHAFARALLAAHU LAKA)",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "(Semoga Allah memberikan ampunan kepadamu):",
                "post_text_id": null,
                "text": "وَلَكَ.",
                "translation_id": "Begitu juga kamu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for those who do good for you",
        "title_id": "Do'a untuk orang yang berbuat kebaikan padamu",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "جَزَاكَ اللهُ خَيْرًا.",
                "translation_id": "Semoga Allah membalasmu dengan kebaikan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Cara menyelamatkan diri dari dajjal",
        "title_id": "How to save yourself from Dajjal",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُوْرَةِ الْكَهْفِ عُصِمَ مِنَ الدَّجَّالِ وَاْلاِسْتِعَاذَةُ بِاللهِ مِنْ فِتْنَتِهِ عَقِبَ التَّشَهُّدِ اْلأَخِيْرِ مِنْ كُلِّ صَلاَةٍ.",
                "translation_id": "Barang siapa yang hafal sepuluh ayat dari permulaan surah Al-Kahfi, maka terpelihara dari (gangguan) dajjal\". Begitu juga minta perlindungan kepada Allah dari fitnah Dajjal setelah tasyahud akhir dari setiap shalat.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to people who say: I Love You because of Allah",
        "title_id": "Do'a kepada orang yang berkata: Aku Mencintaimu Karena Allah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ.",
                "translation_id": "Semoga Allah mencintaimu, karena engkau telah mencintaiku karena-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to the people who offers his treasure for you",
        "title_id": "Do'a kepada orang yang menawarkan hartanya untukmu",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بَارَكَ اللهُ لَكَ فِيْ أَهْلِكَ وَمَالِكَ.",
                "translation_id": "Semoga Allah memberkahi keluarga dan hartamu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a for people who provide loans when paying debts",
        "title_id": "Do'a untuk orang yang meminjami ketika membayar hutang",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بَارَكَ اللهُ لَكَ فِيْ أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَاْلأَدَاءِ.",
                "translation_id": "Semoga Allah memberikan berkah kepadamu dalam keluarga dan hartamu. Sesungguhnya balasan meminjami adalah pujian dan pembayaran.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to avoid from syirik",
        "title_id": "Do'a agar terhindar dari syirik",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ.",
                "translation_id": "Ya Allah! Sesungguhnya aku berlindung kepada-Mu, agar tidak menyekutukan-Mu, sedang aku mengetahuinya dan minta ampun terhadap apa yang tidak aku ketahui.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a to the people who say: (BAARAKALLAHU FIIKA)",
        "title_id": "Do'a untuk orang yang mengatakan: (BAARAKALLAHU FIIKA)",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَفِيْكَ بَارَكَ اللهُ.",
                "translation_id": "Semoga Allah juga memberkahimu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a rejects bad feelings / bad luck",
        "title_id": "Do'a menolak firasat buruk / sial",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ لاَ طَيْرَ إِلاَّ طَيْرُكَ، وَلاَ خَيْرَ إِلاَّ خَيْرُكَ، وَلاَ إِلَـهَ غَيْرُكَ.",
                "translation_id": "Ya Allah! Tidak ada kesialan kecuali kesialan yang Engkau tentukan, dan tidak ada kebaikan kecuali kebaikan-Mu, serta tiada Tuhan (yang berhak disembah) selain Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a riding vehicle",
        "title_id": "Do'a naik kendaraan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ، الْحَمْدُ لِلَّهِ ﴿ سُبْحَانَ الَّذِىْ سَخَّرَلَنَا هَذَا وَمَاكُنَّالَهُ مُقْرِنِيْنَ وَاِنَّآ اِلَى رَبِّنَا لَمُنْقَلِبُوْنَ ﴾ الْحَمْدُ لِلَّهِ الْحَمْدُ لِلَّهِ الْحَمْدُ لِلَّهِ اللهُ أَكْبَرُ اللهُ أَكْبَرُ، اللهُ أَكْبَرُ سُبْحَانَكَ اللَّهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ.",
                "translation_id": "Dengan nama Allah, segala puji bagi Allah, Maha Suci Tuhan yang menundukkan kendaraan ini untuk kami, padahal kami sebelumnya tidak mampu menguasainya. Dan sesungguhnya kami akan kembali kepada Tuhan kami (di hari kiamat). Segala puji bagi Allah (3x), Maha Suci Engkau, ya Allah! Sesungguhnya aku menganiaya diriku, maka ampunilah aku. Sesungguhnya tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when traveling",
        "title_id": "Do'a bepergian",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ،   ﴿ سُبْحَانَ الَّذِىْ سَخَّرَلَنَا هَذَا وَمَاكُنَّالَهُ مُقْرِنِيْنَ وَاِنَّآ اِلَى رَبِّنَا لَمُنْقَلِبُوْنَ ( ١٣ ) وَإِنَّا إليَ رَبِّنِا َلمُنْقَلِبُون ﴾اللَّهُمَّ إِنَّا نَسْأَلُكَ فِيْ سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيْفَةُ فِي اْلأَهْلِ، اللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوْءِ الْمُنْقَلَبِ فِي الْمَالِ وَاْلأَهْلِ. وَإِذَا رَجَعَ قَالَهُنَّ وَزَادَ فِيْهِنَّ: آيِبُوْنَ تَائِبُوْنَ عَابِدُوْنَ لِرَبِّنَا حَامِدُوْنَ.",
                "translation_id": "Allah Maha Besar (3x). Maha Suci Tuhan yang menundukkan kendaraan ini untuk kami, sedang sebelumnya kami tidak mampu. Dan sesungguhnya kami akan kembali kepada Tuhan kami (di hari kiamat). Ya Allah! Sesungguhnya kami memohon kebaikan dan taqwa dalam bepergian ini, kami mohon perbuatan yang meridhakan-Mu. Ya Allah! Permudahlah perjalanan kami ini, dan dekatkan jaraknya bagi kami. Ya Allah! Engkaulah teman dalam bepergian dan yang mengurusi keluarga (ku). Ya Allah! Sesungguhnya aku berlindung kepada-Mu dari kelelahan dalam bepergian, pemandangan yang menyedihkan dan perubahan yang jelek dalam harta dan keluarga.\" Apabila kembali, do'a di atas dibaca, dan ditambah: \"Kami kembali dengan bertaubat, tetap beribadah dan selalu memuji kepada Tuhan kami\".",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a entering village or city",
        "title_id": "Do'a masuk desa atau kota",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ اْلأَرَضِيْنَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنَ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ. أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ أَهْلِهَا وَشَرِّ مَا فِيْهَا.",
                "translation_id": "Ya Allah, Tuhan tujuh langit dan apa yang dinaunginya, Tuhan penguasa tujuh bumi dan apa yang di permukaannya, Tuhan yang menguasai setan-setan dan apa yang mereka sesatkan, Tuhan yang menguasai angin dan apa yang diterbangkannya. Aku mohon kepada-Mu kebaikan desa ini, kebaikan penduduknya dan apa yang ada di dalamnya. Aku berlindung kepada-Mu dari kejelekan desa ini, kejelekan penduduknya dan apa yang ada di dalamnya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a entering market",
        "title_id": "Do'a masuk pasar",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِيْ وَيُمِيْتُ وَهُوَ حَيٌّ لاَ يَمُوْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ.",
                "translation_id": "Tidak ada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan, bagi-Nya segala pujian. Dia-lah Yang Menghidupkan dan Yang Mematikan. Dia-lah Yang Hidup, tidak akan mati. Di tangan-Nya kebaikan. Dia-lah Yang Maha Kuasa atas segala sesuatu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when the riding animal slips",
        "title_id": "Do'a apabila binatang tunggangan tergelincir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ.",
                "translation_id": "Dengan nama Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when musafer to the one left behind",
        "title_id": "Do'a musafir kepada orang yang ditinggalkan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَسْتَوْدِعُكُمُ اللهَ الَّذِيْ لاَ تَضِيْعُ وَدَائِعُهُ.",
                "translation_id": "Aku menitipkan kalian kepada Allah yang tidak akan hilang titipan-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a people to the musafir",
        "title_id": "Do'a orang mukim kepada musafir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَسْتَوْدِعُ اللهَ دِيْنَكَ وَأَمَانَتَكَ وَخَوَاتِيْمَ عَمَلِكَ.",
                "translation_id": "Aku menitipkan agama, amanah dan penutup amalmu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "زَوَّدَكَ اللهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الْخَيْرَ حَيْثُ مَا كُنْتَ.",
                "translation_id": "Semoga Allah memberi bekal taqwa kepadamu, mengampuni dosamu dan memudahkan kebaikan kepadamu di mana saja engkau berada.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Takbir and Tasbih in a travel",
        "title_id": "Takbir dan Tasbih dalam perjalanan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ جَابِرٌ رَضِيَ اللهُ عَنْهُ: كُنَّا إِذَا صَعَدْنَا كَبَّرْنَا، وَإِذَا نَزَلْنَا سَبَّحْنَا.",
                "translation_id": "Dari Jabir R.A, dia berkata: \"Kami apabila berjalan menanjak, membaca takbir, dan apabila kami turun, membaca tasbih.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Musafir Du'a when around subuh",
        "title_id": "Do'a musafir ketika menjelang subuh",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلاَئِهِ عَلَيْنَا. رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذًا بِاللهِ مِنَ النَّارِ.",
                "translation_id": "Semoga ada yang memperdengarkan puji kami kepada Allah (atas nikmat) dan cobaan-Nya yang baik bagi kami. Wahai Tuhan kami, temanilah kami (peliharalah kami) dan berilah karunia kepada kami dengan berlindung kepada Allah dari api Neraka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when stopping somewhere, whether traveling or not",
        "title_id": "Do'a apabila singgah di suatu tempat, baik dalam bepergian atau tidak",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
                "translation_id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna, dari kejahatan makhluk-Nya.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a when coming home from a travel",
        "title_id": "Do'a apabila pulang dari bepergian",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Bertakbir tiga kali, di atas tempat yang tinggi, kemudian membaca:",
                "post_text_id": null,
                "text": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. آيِبُوْنَ تَائِبُوْنَ عَابِدُوْنَ لِرَبِّنَا حَامِدُوْنَ، صَدَقَ اللهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ اْلأَحْزَابَ وَحْدَهُ.",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujaan. Dia-lah Yang Maha Kuasa atas segala sesuatu. Kami kembali dengan bertaubat, beribadah dan memuji kepada Tuhan kami. Allah telah menepati janji-Nya, membela hamba-Nya (Muhammad) dan mengalahkan musuh sendirian.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Read when something is pleasant or troublesome",
        "title_id": "Bacaan apabila ada sesuatu yang menyenangkan atau menyusahkan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Rasulullah ﷺ apabila ada sesuatu yang menyenangkan, beliau membaca:",
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ.",
                "translation_id": "Segala puji bagi Allah yang dengan nikmat-Nya segala amal shalih sempurna.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Apabila ada sesuatu yang tidak disukai, beliau membaca:",
                "post_text_id": null,
                "text": "الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
                "translation_id": "Segala puji bagi Allah, atas segala keadaan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The virtues of reading shalawat",
        "title_id": "Keutamaan membaca shalawat",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ ﷺ: مَنْ صَلَّى عَلَيَّ صَلاَةً صَلَّى اللهُ عَلَيْهِ بِهَا عَشْرًا",
                "translation_id": "Barangsiapa yang membaca shalawat kepadaku sekali, Allah akan memberikan balasan shalawat kepadanya sepuluh kali.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: لاَ تَجْعَلُوْا قَبْرِي عِيْدًا وَصَلُّوْا عَلَيَّ؛ فَإِنَّ صَلاَتَكَ تَبْلُغُنِي حَيْثُ كُنْتُمْ.",
                "translation_id": "Janganlah kamu menjadikan kuburanku sebagai hari raya, dan bacalah shalawat padaku, sesungguhnya bacaan shalawatmu akan sampai kepadaku, di mana saja kamu berada.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: الْبَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ",
                "translation_id": "Orang yang bakhil adalah orang yang apabila aku disebut, dia tidak membaca shalawat kepadaku.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: إِنَّ لِلَّهِ مَلاَئِكَةً سَيَّاحِيْنَ فِي اْلأَرْضِ يُبَلِّغُوْنِي مِنْ أُمَّتِي السَّلاَمَ.",
                "translation_id": "Sesungguhnya Allah mempunyai para malaikat yang senantiasa berkeliling di bumi yang akan menyampaikan salam kepadaku dari umatku.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلاَّ رَدَّ اللهُ عَلَيَّ رُوْحِيَ حَتَّى أَرُدَّ عَلَيْهِ السَّلاَمَ.",
                "translation_id": "Tidaklah seseorang mengucapkan salam kepadaku kecuali Allah mengembalikan ruhku kepadaku sehingga aku membalas salam-(nya).",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Spreading Salam",
        "title_id": "Menyebarkan Salam",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "َالَ ﷺ: لاَ تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوْا، وَلاَ تُؤْمِنُوْا حَتَّى تَحَابُّوْا، أَوَلاَ أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوْهُ تَحَابَبْتُمْ، أَفْشُوا السَّلاَمَ بَيْنَكُمْ.",
                "translation_id": "Kamu tidak akan masuk Surga hingga kamu beriman, kamu tidak akan beriman secara sempurna hingga kamu saling mencintai. Maukah kamu kutunjukkan sesuatu, apabila kamu lakukan akan saling mencintai? Biasakan mengucapkan salam di antara kamu.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "ثَلاَثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ اْلإِيْمَانَ: اْلإِنْصَافُ مِنْ نَفْسِكَ، وَبَذْلُ السَّلاَمِ لِلْعَالَمِ، وَاْلإِنْفَاقُ مِنَ اْلإِقْتَارِ.",
                "translation_id": "Ada tiga perkara, barang siapa yang bisa mengerjakannya, maka sungguh telah mengumpulkan keimanan: 1.Berlaku adil terhadap diri sendiri; 2.Menyebarkan salam ke seluruh penduduk dunia; 3.Berinfak dalam keadaan fakir.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَعَنْ عَبْدِ اللهِ بْنِ عُمَرَ : أَنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ: أَيُّ اْلإِسْلاَمِ خَيْرٌ، قَالَ: تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ.",
                "translation_id": "Sesungguhnya seorang laki-laki bertanya kepada Nabi ﷺ, manakah ajaran Islam yang lebih baik?\" Rasul ﷺ bersabda: \"Hendaklah engkau memberi makanan, mengucapkan salam kepada orang yang kamu kenal dan yang tidak.\"",
                "inline_pre_translation_id": "Dari Abdullah bin Umar R.A dia berkata:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "When kafir people say salam",
        "title_id": "Apabila orang kafir mengucapkan salam",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُوْلُوْا: وَعَلَيْكُمْ.",
                "translation_id": "Apabila ahli kitab mengucapkan salam kepadamu, jawablah: Wa'alai-kum.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The clue when hearing a rooster crow or donkey braying",
        "title_id": "Petunjuk ketika mendengar kokok ayam atau ringkikan keledai",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِذَا سَمِعْتُمْ صِيَاحَ الدِّيْكَةِ فَاسْأَلُوا اللهَ مِنْ فَضْلِهِ، فَإِنَّهَا رَأَتْ مَلَكًا، وَإِذَا سَمِعْتُمْ نَهِيْقَ الْحِمَارِ فَتَعَوَّذُوْا بِاللهِ مِنَ الشَّيْطَانِ، فَإِنَّهُ رَأَى شَيْطَانًا.",
                "translation_id": "Apabila kamu mendengar ayam berkokok, mintalah anugerah kepada Allah, sesungguhnya ia melihat malaikat. Tapi apabila engkau mendengar keledai meringkik, mintalah perlindungan kepada Allah dari gangguan setan, sesungguhnya ia melihat setan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The clue when hearing dogs barking",
        "title_id": "Petunjuk apabila mendengar anjing menggonggong",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ وَنَهِيْقَ الْحَمِيْرِ بِاللَّيْلِ فَتَعَوَّذُوْا بِاللهِ مِنْهُنَّ فَإِنَّهُنَّ يَرَيْنَ مَا لاَ تَرَوْنَ.",
                "translation_id": "Apabila kamu mendengar anjing menggonggong dan mendengar keledai meringkik di malam hari, mintalah perlindungan kepada Allah. Sesungguhnya mereka melihat apa yang tidak kamu lihat.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Praying people you've insulting",
        "title_id": "Mendo'akan orang yang anda caci",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ",
                "translation_id": "Ya Allah, siapa saja orang mukmin yang kucaci, jadikanlah sebagai sarana yang mendekatkan dirinya kepada-Mu di hari Kiamat.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "When praising his friend",
        "title_id": "Apabila memuji temannya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ ﷺ: إِذَا كَانَ أَحَدُكُمْ مَادِحًا صَاحِبَهُ لاَ مَحَالَةَ فَلْيَقُلْ: أَحْسِبُ فُلاَنًا وَاللهُ حَسِيْبُهُ وَلاَ أُزَكِّيْ عَلَى اللهِ أَحَدًا أَحْسِبُهُ -إِنْ كَانَ يَعْلَمُ ذَاكَ- كَذَا وَكَذَا.",
                "translation_id": "Apabila seseorang harus memuji saudaranya, katakanlah: \"Aku kira Fulan ... dan Allah-lah yang mengawasi perbuatannya. Dan aku tidak akan memuji seseorang di-hadapan Allah\". Apabila seseorang mengetahui hendaklah berkata: 'Aku kira begini dan begini'",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading when people praise",
        "title_id": "Bacaan bila dipuji orang",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اَللَّهُمَّ لاَ تُؤَاخِذْنِيْ بِمَا يَقُوْلُوْنَ، وَاغْفِرْلِيْ مَالاَ يَعْلَمُوْنَ وَاجْعَلْنِيْ خَيْرًا مِمَّا يَظُنُّوْنَ",
                "translation_id": "Ya Allah, semoga Engkau tidak menghukumku karena apa yang mereka katakan. Ampunilah aku atas apa yang tidak mereka ketahui. Dan jadikanlah aku lebih baik daripada yang mereka perkirakan.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Talbiyah Reading",
        "title_id": "Bacaan Talbiyah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيْكَ لَكَ.",
                "translation_id": "Aku memenuhi panggilan-Mu, ya Allah aku memenuhi panggilan-Mu. Aku memenuhi panggilan-Mu, tiada sekutu bagi-Mu, aku memenuhi panggilan-Mu. Sesungguhnya pujaan dan nikmat adalah milik-Mu, begitu juga kerajaan, tiada sekutu bagi-Mu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Doing takbir each come into Rukun Hajar Aswad",
        "title_id": "Bertakbir di setiap datang ke Rukun Hajar Aswad",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "طَافَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِالْبَيْتِ عَلَى بَعِيْرٍ كُلَّمَا أَتَى الرُّكْنَ أَشَارَ إِلَيْهِ بِشَيْءٍ عِنْدَهُ وَكَبَّرَ.",
                "translation_id": "Nabi ﷺ melakukan thawaf di Baitullah, di atas unta, setiap datang ke sisi hajar aswad, beliau memberi isyarat dengan sesuatu yang dipegangnya dan bertakbir.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a among Rukun Yamani and Hajar Aswad",
        "title_id": "Do'a antara Rukun Yamani dan Hajar Aswad",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
                "translation_id": "Wahai Tuhan kami! Berilah kami kebaikan di dunia dan kebaikan di akhirat, dan jauhkan kami dari siksaan api Neraka.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "(QS. al-Baqarah : 201)"
            }
        ]
    },
    {
        "title_en": "Reading while on Shafa Hill and Marwah",
        "title_id": "Bacaan ketika di atas Bukit Shafa dan Marwah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Ketika Nabi ﷺ dekat dengan bukit Shafa, beliau membaca:",
                "post_text_id": null,
                "text": "إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ ۖ.  َبْدَأُ بِمَا بَدَأَ اللهُ بِهِ.",
                "translation_id": "Sesungguhnya Shafa dan Marwah adalah termasuk sy'iar agama Allah. Aku memulai sa'i dengan apa yang didahulukan oleh Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Kemudian beliau mulai naik ke bukit Shafa, hingga beliau melihat Baitullah. Lalu menghadap kiblat, membaca kalimat tauhid dan takbir, serta membaca:",
                "post_text_id": "Kemudian beliau berdo'a di antara Shafa dan Marwah. Beliau membacanya tiga kali. Di dalam hadits tersebut dikatakan, Nabi ﷺ juga membaca di Marwah sebagaimana beliau membaca di Shafa.",
                "text": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ اْلأَحْزَابَ وَحْدَهُ",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, Tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujian. Dia-lah Yang Maha Kuasa atas segala sesuatu. Tiada Tuhan yang berhak disembah selain Allah Yang Maha Esa, yang melaksanakan janji-Nya, membela hamba-Nya (Muhammad) dan mengalahkan musuh sendirian.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Du'a on Arafah Day",
        "title_id": "Do'a pada Hari Arafah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": "Do'a yang paling utama adalah di hari Arafah, dan sebaik-baik apa yang aku dan para nabi sebelumku baca pada hari itu, adalah:",
                "inline_pre_translation_id": "Nabi ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ.",
                "translation_id": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, Tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujian. Dia-lah Yang Maha Kuasa atas segala sesuatu.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "When in Masy'aril Haram",
        "title_id": "Ketika di Masy'aril Haram",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "رَكِبَ ﷺ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ (فَدَعَاهُ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ.",
                "translation_id": "Nabi ﷺ naik unta bernama Al-Qaswa' hingga di Masy'aril Haram, lalu beliau menghadap kiblat, berdo'a, membaca takbir dan tahlil serta kalimat tauhid. Beliau terus berdo'a hingga fajar menyingsing. Kemudian beliau berangkat (ke Mina) sebelum matahari terbit.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Doing Takbir each Throwing Jumrah",
        "title_id": "Bertakbir pada setiap Lemparan Jumrah",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الْجِمَارِ الثَّلاَثِ ثُمَّ يَتَقَدَّمُ، وَيَقِفُ يَدْعُو مُسْتَقْبِلَ الْقِبْلَةِ، رَافِعًا يَدَيْهِ بَعْدَ الْجَمْرَةِ اْلأُوْلَى وَالثَّانِيَةِ. أَمَّا جَمْرَةُ الْعَقَبَةِ فَيَرْمِيْهَا وَيُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ وَيَنْصَرِفُ وَلاَ يَقِفُ عِنْدَهَا.",
                "translation_id": "Rasulullah ﷺ bertakbir pada setiap kali melempar tiga Jumrah dengan batu kecil, kemudian beliau maju dan berdiri untuk berdo'a dengan menghadap kiblat dan mengangkat kedua tangannya setelah melempar Jumrah yang pertama dan kedua. Adapun untuk Jumrah Aqabah, beliau melempar dan bertakbir, dan beliau tidak berdiri di sana, tapi langsung pergi (tidak berdo'a).",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading when in awe of something",
        "title_id": "Bacaan ketika kagum terhadap sesuatu",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "سُبْحَانَ اللهِ.",
                "translation_id": "Maha Suci Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "اللهُ أَكْبَرُ.",
                "translation_id": "Allah Maha Besar.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "What to do when something is exciting",
        "title_id": "Yang dilakukan bila ada sesuatu yang menggembirakan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "كَانَ النَّبِيُّ ﷺ إِذَا أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ خَرَّ سَاجِدًا شُكْرًا لِلَّهِ تَبَارَكَ وَتَعَالَى.",
                "translation_id": "Nabi ﷺ apabila ada sesuatu yang menggembirakan atau menyenangkannya, beliau bersujud, pertanda syukur kepada Allah Yang Maha Suci dan Maha Tinggi.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Readings and actions when feeling pain in the body",
        "title_id": "Bacaan dan perbuatan apabila merasa sakit pada anggota badan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": "Letakkanlah tanganmu pada tubuh yang terasa sakit, dan bacalah: \"Bismillah\" 3 kali, lalu bacalah tujuh kali:",
                "post_text_id": null,
                "text": "أَعُوْذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.",
                "translation_id": "Aku berlindung kepada Allah dan kekuasaan-Nya dari kejahatan sesuatu yang aku jumpai dan yang aku takuti",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "When afraid of something with his eyes",
        "title_id": "Apabila takut mengenai sesuatu dengan matanya",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِذَا رَأَى أَحَدُكُمْ مِنْ أَخِيْهِ أَوْ مِنْ نَفْسِهِ أَوْ مِنْ مَالِهِ مَا يُعْجِبُهُ (فَلْيَدْعُ لَهُ بِالْبَرَكَةِ) فَإِنَّ الْعَيْنَ حَقٌّ.",
                "translation_id": "Apabila seseorang di antara kamu melihat dari saudaranya, diri atau hartanya yang menakjubkan, maka hendaklah ia mendo'akan berkah kepadanya. Sesungguhnya 'ain (kena mata) itu adalah benar.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Reading when scared",
        "title_id": "Bacaan ketika takut",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ إِلَـهَ إِلاَّ اللهُ.",
                "translation_id": "Tiada Tuhan yang berhak disembah kecuali Allah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The reading when slaughtering a sacrifice",
        "title_id": "Bacaan ketika menyembelih kurban",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "بِسْمِ اللهِ وَاللهُ أَكْبَرُ (اللَّهُمَّ مِنْكَ وَلَكَ) اَللَّهُمَّ تَقَبَّلْ مِنِّيْ.",
                "translation_id": "Dengan nama Allah, (aku menyembelih), Allah Maha Besar. Ya Allah! (ternak ini) dari-Mu (nikmat yang Engkau berikan, dan kami sembelih) untuk-Mu. Ya Allah! Terimalah kurban ini dariku.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Readings to reject Satan's interference",
        "title_id": "Bacaan untuk menolak gangguan setan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِيْ لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيْهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي اْلأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلاَّ طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَانُ.",
                "translation_id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna, yang tidak akan diterobos oleh orang baik dan orang durhaka, dari kejahatan apa yang diciptakan-Nya, dari kejahatan apa yang turun dari langit dan yang naik ke dalamnya, dari kejahatan yang tumbuh di bumi dan yang keluar daripadanya, dari kejahatan fitnah-fitnah malam dan siang, serta dari kejahatan-kejahatan yang datang (di waktu malam) kecuali dengan tujuan baik, wahai Tuhan Yang Maha Pengasih.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Istighfar and Taubat",
        "title_id": "Istighfar dan Taubat",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ رَسُوْلُ الله ﷺ: وَاللهِ إِنِّيْ َلأَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِيْنَ مَرَّةً.",
                "translation_id": "Demi Allah! Sesungguhnya aku minta ampun kepada Allah dan bertaubat kepada-Nya dalam sehari lebih dari tujuh puluh kali.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: يَا أَيُّهَا النَّاسُ تُوْبُوْا إِلَى اللهِ فَإِنِّيْ أَتُوْبُ فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ.",
                "translation_id": "Wahai manusia! Bertaubatlah kepada Allah, sesungguhnya aku bertaubat kepada-Nya seratus kali dalam sehari.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "أَسْتَغْفِرُ اللهَ الْعَظِيْمَ الَّذِيْ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّوْمُ وَأَتُوْبُ إِلَيْهِ.",
                "translation_id": "Barangsiapa yang membaca: \"Aku minta ampun kepada Allah, tiada Tuhan yang berhak disembah kecuali Dia, Yang Hidup dan terus-menerus mengurus makhluk-Nya.\" Maka Allah mengampuni dosa-dosanya. Sekalipun dia pernah melarikan diri dari medan perang.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: أَقْرَبُ مَا يَكُوْنُ الرَّبُّ مِنَ الْعَبْدِ فِيْ جَوْفِ اللَّيْلِ اْلآخِرِ فَإِنِ اسْتَطَعْتَ أَنْ تَكُوْنَ مِمَّنْ يَذْكُرُ اللهَ فِيْ تِلْكَ السَّاعَةِ فَكُنْ.",
                "translation_id": "Keadaan yang paling dekat antara Tuhan dan hamba-Nya adalah di penghujung malam. Apabila kamu mampu berdzikir kepada Allah pada saat itu, lakukanlah.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: أَقْرَبُ مَا يَكُوْنُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ.",
                "translation_id": "Seorang hamba berada dalam keadaan yang paling dekat dengan Tuhannya adalah di saat sujud. Oleh karena itu, perbanyaklah do'a.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: إِنَّهُ لَيُغَانُ عَلَى قَلْبِيْ وَإِنِّيْ لأَسْتَغْفِرُ اللهَ فِي الْيَوْمِ مِائَةَ مَرَّةٍ",
                "translation_id": "Sesungguhnya hatiku lupa (tidak ingat kepada Allah) padahal sesungguhnya aku minta ampun kepada-Nya dalam sehari seratus kali.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "The virtues of Tasbih, Tahmid, Tahlil and Takbir",
        "title_id": "Keutamaan Tasbih, Tahmid, Tahlil dan Takbir",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "قَالَ ﷺ: مَنْ قَالَ سُبْحَانَ اللهِ وَبِحَمْدِهِ فِيْ يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.",
                "translation_id": "Barang siapa yang membaca: “Maha Suci Allah dan aku memuji-Nya\", dalam sehari seratus kali, maka kesalahannya akan dihapuskan sekalipun seperti buih air laut.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: مَنْ قَالَ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، عَشْرَ مِرَارٍ، كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيْلَ.",
                "translation_id": "Barang siapa yang membaca: Laailaaha illallaah wahdahu laa syariika lahu lahulmulku walahulhamdu wahuwa 'alaa kulli syaiin qadiir, sepuluh kali, maka dia seperti orang yang memerdekakan empat orang budak dari keturunan Nabi Ismail.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: كَلِمَتَانِ خَفِيْفَتَانِ عَلَى اللِّسَانِ ثَقِيْلَتَانِ فِي الْمِيْزَانِ حَبِيْبَتَانِ إِلَى الرَّحْمَـانِ: سُبْحَانَ اللهِ وَبِحَمْدِهِ سُبْحَانَ اللهِ الْعَظِيْمِ.",
                "translation_id": "Dua kalimat yang ringan di lidah, pahalanya berat di timbangan (hari Kiamat) dan disukai oleh Tuhan Yang Maha Pengasih, adalah: Subhaanallaah wabi-hamdih, subhaanallaahil 'azhiim.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: لأَنْ أَقُوْلَ سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَـهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ، أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ.",
                "translation_id": "Sungguh, apabila aku membaca: 'Subhaanallah walhamdulillaah walaa ilaaha illallaah wallaahu akbar'. Adalah lebih ku cintai dari apa yang disinari oleh matahari terbit.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَوْمٍ أَلْفَ حَسَنَةٍ فَسَأَلَهُ سَائِلٌ مِنْ جُلَسَائِهِ، كَيْفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قَالَ: يُسَبِّحُ مِائَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ أَوْ يُحَطُّ عَنْهُ أَلْفُ خَطِيْئَةٍ.",
                "translation_id": "Apakah seseorang di antara kamu tidak mampu mendapatkan seribu kebaikan setiap hari?\" Salah seorang di antara yang duduk bertanya: “Bagaimana mungkin di antara kita bisa memperoleh seribu kebaikan (dalam sehari)?\" Rasulullah ﷺ bersabda: “Hendaklah dia membaca seratus tasbih, maka ditulis seribu kebaikan baginya atau dihapuskan darinya seribu keburukan.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "مَنْ قَالَ: سُبْحَانَ اللهِ الْعَظِيْمِ وَبِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ.",
                "translation_id": "Barang siapa yang membaca: Subhaanallaahi 'azhiim wabihamdih, maka ditanam untuknya sebatang pohon kurma di Surga.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
                "translation_id": "",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "",
                "translation_id": "Wahai Abdullah bin Qais! Maukah kamu kutunjukkan perbendaharaan Surga?, Aku berkata: \"Aku mau, wahai Rasulullah!\"",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": "Rasulullah ﷺ berkata: \"Bacalah: Laa haula walaa quwwata illaa billaah.\""
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "",
                "translation_id": "",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": "Rasulullah ﷺ berkata:",
                "post_text_id": null,
                "text": null,
                "translation_id": "Bacalah: Laa haula walaa quwwata illaa billaah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "وَقَالَ ﷺ: أَحَبُّ الْكَلاَمِ إِلَى اللهِ أَرْبَعٌ: سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَـهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ، لاَ يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ.",
                "translation_id": "Perkataan yang paling disenangi oleh Allah adalah empat: Subhaanallaah,Alhamdulillaah, Laa ilaaha illallaah, Allaahu akbar. Tidak mengapa dimulai yang mana di antara kalimat tersebut.",
                "inline_pre_translation_id": "Rasulullah ﷺ bersabda:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "جَاءَ أَعْرَابِيٌّ إِلَى رَسُوْلِ اللهِ ﷺ فَقَالَ: عَلِّمْنِيْ كَلاَمًا أَقُوْلُهُ. قَالَ: قُلْ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، اللهُ أَكْبَرُ كَبِيْرًا، وَالْحَمْدُ لِلَّهِ كَثِيْرًا، سُبْحَانَ اللهِ رَبِّ الْعَالَمِيْنَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ الْعَزِيْزِ الْحَكِيْمِ, قَالَ فَهَؤُلاَءِ لِرَبِّيْ فَمَا لِيْ؟ قَالَ: قُلْ، اَللَّهُمَّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاهْدِنِيْ وَارْزُقْنِيْ.",
                "translation_id": "Seorang Arab Badui datang kepada Rasulullah ﷺ, lalu berkata: 'Ajari aku dzikir untuk aku baca!' Rasul ﷺ bersabda: 'Katakanlah: Tidak ada Tuhan yang berhak disembah selain Allah Yang Maha Esa, tiada sekutu bagi-Nya. Allah Maha Besar. Segala puji yang banyak bagi Allah. Maha Suci Allah, Tuhan sekalian alam dan tiada kekuatan kecuali dengan pertolongan Allah Yang Maha Mulia lagi Maha Bijaksana.' Orang Badui itu berkata: \"Kalimat itu untuk Tuhanku, mana yang untukku? Rasul ﷺ bersabda: 'Katakanlah: Ya Allah! Ampuni-lah aku, kasihanilah aku, berilah petunjuk kepadaku dan berilah rezeki kepadaku.'",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "كَانَ الرَّجُلُ إِذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلاَةَ ثُمَّ أَمَرَهُ أَنْ يَدْعُوَ بِهَؤُلاَءِ الْكَلِمَاتِ: اَللَّهُمَّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاهْدِنِيْ وَعَافِنِيْ وَارْزُقْنِيْ.",
                "translation_id": "Ya Allah, ampunilah aku, kasihanilah aku, berilah petunjuk kepadaku, melindungi (dari apa yang tidak kuinginkan) dan berilah rezeki kepadaku.",
                "inline_pre_translation_id": "Seorang laki-laki apabila masuk Islam, Nabi ﷺ mengajarinya shalat, kemudian beliau memerintahkan agar berdo’a dengan kalimat ini:",
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "إِنَّ أَفْضَلَ الدُّعَاءِ: الْحَمْدُ لِلَّهِ، وَأَفْضَلَ الذِّكْرِ: لاَ إِلَـهَ إِلاَّ اللهُ.",
                "translation_id": "Sesungguhnya doa yang terbaik adalah membaca: Alhamdulillaah. Dzikir yang terbaik adalah: Laa Ilaaha Illallaah.",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            },
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "الْبَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَـهَ إِلاَّ اللهُ، وَاللهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ.",
                "translation_id": "Kalimat-kalimat yang baik adalah: 'Subhaanallaah, walhamdulillaah, wa laa ilaaha illallaah, wallaahu akbar, walaa haula walaa quwwata illaa billaah.'",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "How Rasulullah ﷺ reding Tasbih",
        "title_id": "Bagaimana cara Rasulullah ﷺ membaca Tasbih",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ: رَأَيْتُ النَّبِيَّ ﷺ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ.",
                "translation_id": "Aku melihat Rasulullah ﷺ menghitung bacaan tasbih (dengan jari-jari) tangan kanannya.",
                "inline_pre_translation_id": "Dari Abdullah bin Amru R.A, dia berkata:",
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Some Adab and Kindness",
        "title_id": "Beberapa Adab dan Kebaikan",
        "type": "dua",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": "Apabila kegelapan malam telah tiba, atau kamu masuk di waktu malam, maka tahanlah anak-anakmu, sesungguhnya setan pada saat itu bertebaran. Apabila malam telah terlewati sesaat, maka lepaskan mereka, tapi tutuplah pintu dan sebut nama Allah (baca: Bismillaah). Sesungguhnya setan tidak membuka pintu yang tertutup, ikatlah gerabahmu (tempat air dari kulit) dan sebutlah nama Allah. Tutuplah bejanamu dan sebutlah nama Allah, sekalipun dengan melintangkan sesuatu di atasnya, dan padamkanlah lampu-lampumu.",
                "translation_id": "",
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    },
    {
        "title_en": "Shalawat and salam about Nabi Muhammad, family and all his friends. Amiin.",
        "title_id": "Shalawat dan salam atas Nabi Muhammad, keluarga dan segenap shahabatnya. Amiin.",
        "type": "note",
        "contents": [
            {
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "inline_pre_translation_id": null,
                "inline_post_translation_id": null
            }
        ]
    }
]