[
    {
        "title_id": "Manasik Haji",
        "type": "section",
        "pre_text_id": null,
        "post_text_id": null,
        "pre_contents": [],
        "contents": [
            {
                "title_id": "Cara Melakukan Haji",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Jika anda melakukan haji Ifrad atau Qiran, hendaklah anda berihram dari miqat yang anda lalui. Dan Jika anda tinggal di daerah miqat, maka berihramlah menurut niat anda dari tempat tersebut.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Dan jika anda melakukan haji Tamattu, maka berihramlah dari tempat tinggal anda pada hari Tarwiyah, yaitu tanggal 8 Dzulhijjah. Mandilah dan pakailah wangi-wangian lebih dahulu sekiranya hal itu memungkinkan, kemudian kenakanlah pakaian ihram, lalu berniatlah dengan membaca:",
                                        "post_text_id": null,
                                        "text": "لَبَّيْكَ حَجًّا لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيْكَ لَكَ",
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Kemudian keluarlah menuju Mina. Lakukanlah shalat Zuhur, Ashar, Maghrib, Isya dan Shubuh di sana, dengan cara meng-qhasar shalat yang empat rakaat (Zuhur, Ashar dan Isya) menjadi dua rakaat-dua rakaat pada waktunya masing-masing, tanpa jama' (digabung).",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Apabila matahari telah terbit pada hari kesembilan Dzul hijjah (esoknya), maka berangkatlah anda menuju Arafah dengan tidak tergesa-gesa dan hindarilah jangan sampai mengganggu sesama jamaah haji. Di Arafah lakukanlah shalat Dzuhur dan Ashar dengan jama' taqdim (menggabungkan dua waktu shalat dilaksanakan di awal waktu) dan qhasar  dengan satu kali azan dan dua kali iqamat.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Tentang wukuf ini, anda harus yakin bahwa anda benar-benar telah berada di dalam batas Arafah (bukan di luarnya). Dan perbanyaklah di sini zikir dan doa, sambil menghadap kiblat dan mengangkat kedua tangan, mencontoh apa yang dilakukan Rasulullah shallallahu 'alaihi wa sallam. Padang Arafah seluruhnya merupakan wukuf, dan hendaklah anda tetap berada disana hingga matahari terbenam.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Apabila matahari telah terbenam, berangkatlah menuju Muzdalifah dengan tenang sambil membaca talbiyah, dan hindarilah jangan sampai mengganggu sesama muslim. Sesampainya anda di Muzdalifah, lakukanlah shalat Maghrib dan Isya dengan jama' dan qhasar. Hendaklah anda menetap di sana hingga anda melakukan shalat Shubuh. Setelah selesai shalat Shubuh perbanyaklah doa dan zikir hingga hari tampak mulai terang, sambil menghadap kiblat dan mengangkat kedua tangan, mengikuti tuntunan Rasulullah shallallahu 'alaihi wa sallam.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Kemudian berangkatlah sebelum matahari terbit menuju Mina sambil membaca talbiyah. Bagi yang udzur, seperti wanita dan orang-orang yang lemah, boleh berangkat menuju Mina pada malam itu juga setelah lewat pertengahan malam. Dan pungutlah di Muzdalifah batu-batu kecil sebanyak tujuh biji saja untuk melempar jumrah Aqabah. Adapun yang lain cukup anda pungut di Mina. Demikian juga tujuh batu yang akan anda pergunakan untuk melempar jumrah Aqabah pada hari raya, tak mengapa bagi anda untuk memungutnya di Mina.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "list",
                                "pre_text_id": "Apabila anda telah tiba di Mina, lakukanlah hal-hal dibawah ini:",
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "list": [
                                    {
                                        "pre_text_id": null,
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null,
                                        "type": "sublist",
                                        "sublist": [
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Lemparlah jumrah Aqabah, yaitu jumrah yang terdekat dari Mekkah, dengan tujuh batu kecil secara berturut-turut sambil bertakbir pada setiap kali lemparan.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Sembelihlah kurban jika anda berkewajiban melakukannya dan makanlah sebagian dagingnya, serta berikan sebagian besarnya kepada orang-orang fakir.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Bercukurlah dengan bersih (gundul) atau pendekkan rambut anda, akan tetapi mencukur bersih lebih utama. Sedang bagi wanita cukup menggunting ujung rambutnya kurang lebih seujung jari. Lebih utama jika ketiga perkara ini dilakukan secara tertib. Namun tak mengapa jika anda dahulukan yang satu dari yang lain.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    },
                                                    {
                                                        "pre_text_id": "Apabila anda telah selesai melempar dan mencukur, berarti anda telah melaksanakan tahallul Awwal, dan selanjutnya anda boleh mengenakan pakaian biasa dan melakukan hal-hal yang tadinya menjadi larangan ihram, kecuali berhubungan dengan istri.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ],
                                "pre_contents": [],
                                "contents": []
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Kemudian berangkatlah menuju Mekkah dan lakukanlah thawaf Ifadah, setelah itu lakukanlah Sa'i jika anda melakukan haji Tamattu, atau jika anda melakukan haji Qiran atau Ifrad akan tetapi anda belum melakukan sa'i sebelumnya (setelah tawaf qudum). Setelah itu anda diperbolehkan berhubungan suami-istri (Tahallul Tsani).",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Thawaf Ifadah ini boleh di akhirkan pelaksanaannya hingga berlalunya hari-hari Mina, baru kemudian menuju Mekkah setelah melempar seluruh Jumrah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Setelah thawaf Ifadhah pada hari Nahr, kembalilah ke Mina. Bermalamlah di sana pada hari Tasyriq, yaitu tgl. 11, 12, dan 13 dan tidak mengapa jika anda bermalam hanya dua malam saja.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Lemparlah ketiga jumrah selama anda menetap dua atau tiga hari di Mina setelah matahari tergelincir. Anda mulai dari Jumrah Ula, yaitu yang jaraknya paling jauh dari Mekkah, kemudian jumrah Wustha (tengah) dan selanjutnya jumrah Aqabah, setiap  jumrah dilempar dengan tujuh batu kecil secara berturut-turut sambil bertakbir pada setiap kali lemparan.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Jika anda menghendaki untuk menetap selama dua hari saja, hendaklah anda meninggalkan Mina sebelum matahari terbenam di hari kedua itu (Nafar Awwal). Dan jika ternyata matahari telah terbenam sebelum anda keluar dari batas Mina, maka hendaklah anda bermalam lagi pada malam hari ketiganya dan melempar jumrah pada hari ketiga itu (Nafar Tsani). Lebih utama hendaknya anda bermalam pada malam ketiga tersebut.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Bagi yang sakit atau yang lemah, boleh mewakilkan kepada orang lain untuk melempar jumrah, dan bagi siapa yang mewakili (orang lain), melempar untuk dirinya sendiri terlebih dahulu, kemudian untuk yang diwakilinya dapat dilaksanakan sekaligus dalam satu tempat jumrah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Apabila anda hendak kembali ke kampung setelah menyelesaikan segala amalan haji, lakukanlah thawaf wada', kecuali bagi wanita yang sedang datang bulan (haidh) dan yang nifas.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Kewajiban-Kewajiban Bagi Yang Sedang Ihram",
                "type": "list",
                "pre_text_id": "Diwajibkan bagi yang sedang berihram untuk haji dan umrah hal-hal berikut:",
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Melaksanakan apa yang diwajibkan Allah kepadanya, seperti kewajiban shalat pada waktunya secara berjamaah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Menjauhi apa yang dilarang Allah, berupa: rafats (berkata buruk, bercumbu mesra dengan istri), fusuq (melanggar perintah agama), jidal (berbantah-bantahan) dan perbuatan maksiat lainnya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Menghindari ucapan atau perbutan yang mengganggu dan menyakiti sesama muslim.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "list",
                                "pre_text_id": "Menjauhi larangan-larangan ihram, yaitu:",
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "list": [
                                    {
                                        "pre_text_id": null,
                                        "post_text_id": "Larangan-larangan tersebut di atas berlaku bagi pria dan wanita.",
                                        "text": null,
                                        "translation_id": null,
                                        "type": "sublist",
                                        "sublist": [
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Mencabut rambut atau memotong kuku. Sedangkan bila rambut atau kuku itu lepas dengan tidak disengaja di saat Ihram, maka ia tidak dikenakan denda apa-apa.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Mempergunakan wangi-wangian di badannya atau pakaiannya, begitu juga pada makanan dan minumannya. Adapun jika ada sisa wangi-wangian yang ia pergunakan saat sebelum ihram, maka tak mengapa.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Membunuh binatang buruan atau menghalaunya, atau membantu orang yang berburu, selagi ia masih dalam keadaan ihram.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Memotong pepohonan atau mencabut tanaman yang masih hijau di tanah haram, begitu juga memungut barang temuan, kecuali jika bermaksud untuk mengumumkannya, karena Rasulullah shallallahu 'alaihi wa sallam melarang semua perbuatan tersebut.  Larangan-larangan ini berlaku pula bagi yang tidak berihram.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Meminang atau melangsungkan akad nikah, baik untuk dirinya maupun untuk orang lain, begitu juga mengadakan hubungan dengan istri atau menjamahnya dengan syahwat selama ia dalam keadaan ihram.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "pre_text_id": "Khusus bagi pria ada larangan-larangan sebagai berikut:",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null,
                                        "type": "sublist",
                                        "sublist": [
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Mengenakan tutup kepala yang melekat. Adapun menggunakan payung atau berteduh di bawah atap kendaraan, atau membawa barang-barang di atas kepala, tidaklah mengapa.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            },
                                            {
                                                "type": "note",
                                                "pre_text_id": null,
                                                "post_text_id": null,
                                                "text": null,
                                                "translation_id": null,
                                                "pre_contents": [],
                                                "contents": [
                                                    {
                                                        "pre_text_id": "Memakai kemeja dan semacamnya yang berjahit untuk menutupi seluruh badan atau sebagiannya, begitu juga jubah, sorban, celana dan sepatu, kecuali jika tidak mendapatkan sarung lalu dia memakai celana, atau tidak mendapatkan sandal kemudian mengenakan sepatu, maka tak mengapa baginya.",
                                                        "post_text_id": null,
                                                        "text": null,
                                                        "translation_id": null
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Sedangkan bagi wanita diharamkan saat ihram untuk menggunakan sarung tangan dan menutup mukanya dengan cadar atau kerudung. Tetapi bila ia berhadapan muka dengan kaum pria yang bukan mahram, maka ia wajib menutup mukanya dengan kerudung atau semacamnya, sebagaimana kalau ia tidak dalam ihram.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Apabila seseorang yang berihram mengenakan pakaian yang berjahit, atau menutup kepalanya, atau mempergunakan wangi-wangian, atau mencabut rambutnya, atau memotong kukunya karena lupa atau tidak mengetahui hukumnya, maka ia tidak dikenakan fidyah. Dan hendaklah segera ia menghentikan perbuatan-perbuatan tadi di saat ia ingat atau mengetahui hukumnya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Bagi yang sedang berihram, boleh mengenakan sandal, cincin, kacamata, alat bantu pendengaran (earphone), jam tangan, ikat pinggang biasa, ikat pinggang bersaku untuk menyimpan uang dan surat-surat.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Diperbolehkan menggganti pakaian ihram dan mencucinya, serta mandi dan membasuh kepala. Apabila lantaran mandi dan membasuh tadi terdapat rambut yang rontok tanpa disengaja, maka ia tak dikenakan apa-apa, begitu juga halnya bila ia terkena luka.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Berziarah ke Masjid Nabawi",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Disunnahkan bagi anda pergi ke Madinah kapan saja, dengan niat ziarah ke Masjid Nabawi dan shalat di dalamnya. Karena shalat di Masjid Nabawi lebih baik dari seribu kali shalat di masjid lain, kecuali Masjidil Haram sebagaimana sabda Nabi Muhammad shallallahu 'alaihi wa sallam.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ziarah ke Masjid Nabawi ini sama sekali tidak ada hubungannya dengan ibadah haji, oleh karena itu tidak perlu berihram maupun membaca talbiyah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Apabila anda telah sampai di Masjid Nabawi, masuklah dengan mendahulukan kaki kanan, bacalah: Bismillahirrahmaanirrahim dan shalawat untuk nabi Muhammad shallallahu 'alaihi wa sallam dan mohonlah kepada Allah agar Dia membukakan untuk anda segala pintu rahmat-Nya, dan bacalah:",
                                        "post_text_id": "Doa ini juga dianjurkan untuk dibaca setiap masuk masjid-masjid yang lain.",
                                        "text": "أَعُوْذُ بِاللهِ الْعَظِيْمِ وَوَجْهِهِ الْكَرِيْمِ وَسُلْطَانِهِ الْقَدِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ . اللهمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
                                        "translation_id": "Aku berlindung kepada Allah yang Maha Agung kepada wajah-Nya yang Maha Mulia, dan kepada kekuasaan-Nya Yang Maha Dahulu (qadim), dari godaan setan yang terkutuk. Ya Allah, bukakanlah bagiku segala pintu rahmat-Mu"
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Setelah memasuki masjid Nabawi, segeralah anda melakukan shalat tahiyatul masjid. Afdhalnya, shalat ini dilakukan di Raudhah, jika tak mungkin, lakukanlah di tempat lain di dalam masjid itu.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Kemudian tujulah makam Rasulullah shallallahu 'alaihi wa sallam, dan berdirilah di depannya menghadap ke arahnya, kemudian ucapkanlah dengan sopan:",
                                        "post_text_id": null,
                                        "text": "السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
                                        "translation_id": "Semoga salam sejahtera, rahmat Allah dan berkah-Nya terlimpah kepadamu wahai Nabi (Muhammad)"
                                    },
                                    {
                                        "pre_text_id": null,
                                        "post_text_id": null,
                                        "text": "اللَّهُمَّ آتِهِ الْوَسِيْلَةَ وَالْفَضِيْلَةَ وَابْعَثْهُ الْمَقَامَ الْمَحْمُوْدَ الَّذِي وَعَدْتَهُ، اللَّهُمَّ أَجْزِهِ عَنْ أُمَّتِهِ أَفْضَلَ الْجَزَاءِ",
                                        "translation_id": "Ya Allah, berilah beliau kedudukan tinggi di sorga serta kemuliaan, dan bangkitkanlah beliau di tempat terpuji yang telah Engkau janjikan kepadanya. Ya Allah, limpahkan kepadanya sebaik-baik pahala, beliau yang telah menyampaikan risalah kepada umatnya"
                                    },
                                    {
                                        "pre_text_id": "Kemudian beranjaklah sedikit kesebelah kanan, agar dapat berada dihadapan makam Abu Bakar radiallahuanhu, ucapkanlah salam kepadanya dan berdoalah memohonkan ampunan dan rahmat Allah untuknya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Kemudian bergeserlah lagi sedikit kesebalah kiri, agar anda dapat berada dihadapan makm Umar radiallahuanhu, ucapkanlah salam dan berdoalah untuknya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Disunnahkan bagi anda berziarah ke masjid Quba dalam keadaan telah bersuci dari hadats, dan lakukan shalat di dalamnya, karena Nabi shallallahu 'alaihi wa sallam melakukan hal itu dan menganjurkannya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Disunnahkan pula bagi anda berziarah ke pemakaman Baqi, Makam Utsman radiallahuanhu (di Baqi) dan juga makam para syuhada Uhud dan makam Hamzah radiallahuanhu, ucapkanlah salam dan berdoa untuk mereka, karena Nabi shallallahu 'alaihi wa sallam pernah menziarahi mereka dan berdoa untuk mereka, dan beliaupun mengajarkan para shahabat, apabila mereka berziarah agar mengucapkan:",
                                        "post_text_id": null,
                                        "text": "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِيْنَ وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لاَحِقُوْنَ نَسْأَلُ اللهَ لَنَا وَلَكُمْ الْعَافِيَةَ",
                                        "translation_id": "Semoga salam sejahtera terlimpahkan untuk kamu sekalian, wahai para penghuni makam yang mu'min dan yang muslim, dan kamipun insya Allah akan menyusul kamu sekalian, semoga Allah mengaruniakan keselamatan untuk kami dan kamu sekalian"
                                    }
                                ]
                            }
                        ],
                        "contents": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Di Madinah Munawwarah tidak ada masjid ataupun tempat yang disunnahkan untuk diziarahi selain Masjid Nabawi dan tempat-tempat tersebut di atas, oleh karena itu janganlah memberatkan diri atau berpayah-payah mengerjakan sesuatu yang tidak ada pahalanya, bahkan mungkin akan mendapatkan dosa karena perbuatan tersebut.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "pre_contents": [],
                "contents": []
            }
        ]
    },
    {
        "title_id": "Beberapa Kesalahan Yang Dilakukan Oleh Sebagian Jamaah Haji",
        "type": "section",
        "pre_text_id": null,
        "post_text_id": "Kita memohon kepada Allah, semoga Dia memperbaiki keadaan ummat Islam dan memberi pemahaman dalam agama serta melindungi kita dan seluruh umat Islam dari fitnah-fitnah yang menyesatkan. Sesungguhnya Allah Maha Mendengar dan Mengabulkan doa hamba-Nya.",
        "pre_contents": [],
        "contents": [
            {
                "title_id": "Beberapa kesalahan dalam Ihram.",
                "type": "note",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "pre_contents": [],
                "contents": [
                    {
                        "pre_text_id": "Melewati miqat tanpa berihram dari miqat tersebut hingga sampai ke Jeddah atau tempat lain. Setelah melewati miqat, baru melakukan ihram dari tempat itu. Hal ini menyalahi perintah Rasul shallallahu 'alaihi wa sallam yang mengharuskan setiap jamaah haji agar berihram dari miqat yang dilaluinya.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    },
                    {
                        "pre_text_id": "Maka, bagi yang melakukan hal tersebut, agar kembali ke miqat yang dilaluinya tadi dan berihram dari miqat itu kalau memang memungkinkan. Jika tidak mungkin, maka ia wajib membayar fidyah dengan menyembelih binatang kurban di Mekkah dan memberikan keseluruhannya kepada orang-orang fakir. Ketentuan tersebut berlaku bagi yang datang lewat udara, darat maupun laut.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    },
                    {
                        "pre_text_id": "Jika tidak melintasi salah satu dari kelima miqat yang sudah ditentukan itu, maka ia dapat berihram dari tempat yang sejajar dengan miqat pertama yang dilaluinya.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    }
                ]
            },
            {
                "title_id": "Beberapa kesalahan dalam thawaf.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Memulai thawaf sebelum Hajar Aswad, sedang yang wajib haruslah dimulai dari Hajar Aswad.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Thawaf di dalam Hijr Isma'il. Itu berarti ia tidak mengelilingi seluruh Ka'bah, tapi hanya sebagiannya saja, karena Hijr Ismail termasuk Ka'bah, maka dengan demikian thawafnya tidak sah (batal).",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Raml (berlari-lari kecil) pada seluruh putaran yang tujuh. Padahal raml itu hanya dilakukan pada tiga putaran pertama dan itupun hanya dalam thawaf qudum saja tidak pada thawaf yang lainnya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Berdesak-desakkan untuk dapat mencium Hajar Aswad, kadang-kadang sampai pukul-memukul dan saling mencaci-maki. Hal itu tidak boleh, karena dapat menyakiti sesama muslim, di samping memaki dan memukul antar sesama muslim itu dilarang kecuali dengan jalan yang dibenarkan agama.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Tidak mencium Hajar Aswad sebenarnya tidak membatalkan thawaf, thawafnya tetap sah  sekalipun tidak menciumnya. Maka cukuplah dengan berisyarat (melambaikan tangan) dan bertakbir di saat berada sejajar dengan Hajar Aswad, walaupun dari jauh.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Mengusap-usap Hajar Aswad dengan maksud untuk mendapatkan barokah dari batu itu. Hal ini adalah bid'ah, tidak mempunyai dasar sama sekali dalam syari'at Islam. Sedang menurut tuntunan Rasulullah shallallahu 'alaihi wa sallam cukup dengan menjamah atau menciumnya saja. Itupun kalau memungkinkan.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Menjamah seluruh pojok Ka'bah, bahkan kadang-kadang menjamah dan mengusap-usap seluruh dindingnya. Padahal Rasulullah shallallahu 'alaihi wa sallam tidak pernah menjamah bagian-bagian Ka'bah kecuali Hajar Aswad dan Rukun Yamani saja.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Menentukan doa khusus untuk setiap putaran dalam thawaf. Karena hal itu tak pernah dilakukan oleh Nabi shallallahu 'alaihi wa sallam. Adapun yang beliau lakukan setiap melewati Hajar Aswad adalah bertakbir pada setiap akhir putaran antara Hajar Aswad dan Rukun Yamani beliau membaca:",
                                        "post_text_id": null,
                                        "text": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
                                        "translation_id": "Wahai Tuhan kami, berilah kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari siksaan api neraka."
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Mengeraskan suara pada waktu thawaf sebagaimana yang dilakukan oleh sebagian jamaah atau para muthawwif yang dapat mengganggu orang lain yang juga sedang melakukan thawaf.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Berdesak-desakkan untuk melakukan shalat di dekat Maqam Ibrahim. Hal ini menyalahi sunnah, disamping mengganggu orang-orang yang sedang thawaf. Shalat dua rakaat thawaf dapat dilakukan di tempat lain di dalam Masjid Haram.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Beberapa kesalahan dalam Sa'i.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ada sebagian jamaah haji, ketika naik ke atas Shafa dan Marwah, mereka menghadap Ka'bah dan mengangkat tangan ke arahnya sewaktu membaca takbir, seolah-olah mereka bertakbir untuk shalat. Hal ini keliru, karena Nabi shallallahu 'alaihi wa sallam mengangkat kedua telapak tangan beliau yang mulia hanyalah disaat berdoa.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Di bukit itu, cukuplah membaca tahmid dan takbir serta berdoa kepada Allah sesuka hati sambil menghadap Kiblat. Dan lebih utama lagi membaca dzikir yang dilakukan oleh Nabi shallallahu 'alaihi wa sallam saat beliau di bukit Shafa dan Marwah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Berjalan cepat pada waktu Sa'i antara Shafa dan Marwa pada seluruh putaran. Padahal menurut sunnah Rasul, berjalan cepat itu hanyalah dilakukan antara kedua tanda hijau saja. Adapun yang lain cukup dengan berjalan biasa.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Beberapa kesalahan di Arafah.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ada sebagian jamaah haji yang berhenti di luar batas Arafah dan tetap tinggal di tempat tersebut hingga terbenam matahari. Kemudian mereka berangkat ke Muzdalifah tanpa wukuf di Arafah. Ini suatu kesalahan besar, yang mengakibatkan mereka tidak mendapatkan ibadah haji. Karena sesungguhnya haji itu ialah wukuf di Arafah, untuk itu mereka wajib berada di dalam batas Arafah, bukan di luarnya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Maka hendaklah mereka selalu memperhatikan masalah wukuf ini dan berusaha untuk berada dalam batas Arafah. Jika mendapatkan kesulitan, hendaklah mereka memasuki Arafah sebelum terbenam matahari, dan terus menetap di sana hingga terbenam matahari. Dan cukup bagi mereka masuk Arafah di waktu malam khususnya pada malam hari raya kurban.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ada sebagian mereka yang pergi meninggalkan Arafah sebelum terbenam matahari. Ini tidak boleh, karena Rasulullah shallallahu 'alaihi wa sallam wuquf di Arafah sampai matahari terbenam dengan sempurna.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Berdesak-desakkan untuk dapat naik ke atas gunung Arafah (Jabal Rahmah) hingga ke puncaknya yang dapat menimbulkan banyak bahaya, sedangkan seluruh padang Arafah adalah tempat berwuquf, dan naik ke atas gunung Arafah tidak disyariatkan, begitu juga shalat di tempat itu.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ada sebagian jamaah haji yang menghadap ke arah gunung Arafah ketika berdoa, padahal menurut sunnah adalah menghadap kiblat.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ada sebagian jamaah haji membuat gundukan pasir dan batu kerikil pada hari Arafah di tempat-tempat tertentu. Ini suatu perbuatan yang tidak ada dasarnya sama sekali dalam syariat Allah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Beberapa Kesalahan di Muzdalifah.",
                "type": "note",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "pre_contents": [],
                "contents": [
                    {
                        "pre_text_id": "Sebagian jamaah haji, di saat pertama kali tiba di Muzdalifah, sibuk memungut batu kerikil sebelum melaksanakan shalat Maghrib dan Isya dan mereka berkeyakinan bahwa batu-batu kerikil untuk melempar jumrah itu harus diambil dari Muzdalifah.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    },
                    {
                        "pre_text_id": "Yang benar adalah, dibolehkannya mengambil batu-batu itu dari seluruh tempat di Tanah Haram. Sebab keterangan yang benar dari Nabi shallallahu 'alaihi wa sallam bahwasanya beliau tak pernah menyuruh agar dipungutkan untuk beliau batu-batu pelempar jumrah Aqabah itu dari Muzdalifah. Hanya saja beliau pernah dipungutkan untuknya batu-batu itu diwaktu pagi ketika meninggalkan Muzdalifah setelah masuk Mina. Selebihnya, batu-batu itu beliau pungut dari Mina.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    },
                    {
                        "pre_text_id": "Ada pula sebagian mereka yang mencuci batu-batu dengan air, padahal inipun tidak disyariatkan.",
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null
                    }
                ]
            },
            {
                "title_id": "Beberapa Kesalahan Ketika Melempar Jumrah.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Ketika melempar jumrah, ada sebagian jama'ah haji yang beranggapan, bahwa mereka sedang melempar setan. Maka mereka melemparnya dengan penuh kemarahan disertai caci maki terhadapnya. Padahal melempar jumrah itu semata-mata disyariatkan dalam rangka zikir kepada Allah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Sebagian mereka melempar jumrah dengan batu besar, sepatu, atau dengan kayu.  Ini adalah perbuatan berlebih-lebihan dalam masalah agama,  yang dilarang oleh Rasulullah shallallahu 'alaihi wa sallam.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    },
                                    {
                                        "pre_text_id": "Yang disyariatkan dalam melemparnya hanyalah dengan batu-batu kecil sebesar kacang Arab.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Berdesak-desakkan dan pukul-memukul di dekat tempat-tempat jumrah untuk dapat melempar. Sedang yang disyari'atkan adalah agar melempar dengan tenang dan hati-hati, dan berusaha semampu mungkin tidak menyakiti orang lain.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Melemparkan batu-batu tersebut seluruhnya sekaligus, menurut pendapat para ulama hal seperti itu hanya dihitung satu batu saja. Yang disyariatkan adalah melemparkan batu satu-persatu sambil bertakbir pada setiap lemparan.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Mewakilkan untuk melempar, sedangkan ia sendiri mampu, karena menghindari kesulitan dan desak-desakkan. Padahal mewakilkan untuk melempar itu hanya dibolehkan jika ia sendiri tidak mampu karena sakit atau semacamnya.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Beberapa Kesalahan Thawaf Wada'.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": null,
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Sebagian jamaah haji meninggalkan Mina pada hari nafar (tgl. 12 atau 13 Zul hijjah) sebelum melempar jumrah dan langsung melakukan thawaf Wada’. Kemudian kembali ke Mina untuk melempar Jumrah. Setelah itu mereka langsung pergi dari sana menuju negaranya masing-masing. Dengan demikian akhir perjumpaan mereka adalah dengan tempat-tempat jumrah, bukan dengan Baitullah, padahala nabi shallallahu 'alaihi wa sallam bersabda:",
                                        "post_text_id": "Maka dari itu, thawaf Wada’ wajib dilakukan setelah selesai dari seluruh amalan haji dan beberapa saat sebelum bertolak. Setelah melakukan thawaf Wada’ hendaknya jangan menetap di Mekkah, kecuali untuk sedikit keperluan.",
                                        "text": "لاَ يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُوْنَ آخِرُ عَهْدِهِ بِالْبَيْتِ [رواه مسلم ]",
                                        "translation_id": "Janganlah sekali-kali seseorang meninggalkan (Mekkah), sebelum mengakhiri perjumpaannya (dengan melakukan thawaf) di Baitullah"
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Seusai melakukan thawaf Wada’, sebagian mereka keluar dari Masjid dengan berjalan mundur sambil menghadapkan muka ke Ka’bah, mereka mengira bahwa hal itu merupakan penghormatan terhadap Ka’bah. Perbuatan ini adalah bid’ah, tak ada dasarnya sama sekali dalam agama.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Saat sampai di pintu Masjid Haram, setelah melakukan thawaf Wada’, ada sebagian mereka yang berpaling ke Ka’bah dan mengucapkan berbagai doa seakan-akan mereka mengucapkan selamat tinggal kepada Ka’bah. Inipun bid’ah, tidak disyariatkan.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            },
            {
                "title_id": "Beberapa Kesalahan Ketika Ziarah Ke Masjid Nabawi.",
                "type": "list",
                "pre_text_id": null,
                "post_text_id": "null",
                "text": null,
                "translation_id": null,
                "list": [
                    {
                        "pre_text_id": null,
                        "post_text_id": null,
                        "text": null,
                        "translation_id": null,
                        "type": "sublist",
                        "sublist": [
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Mengusap-usap dinding dan tiang-tiang besi ketika menziarahi makam Rasulullah shallallahu 'alaihi wa sallam, dan mengikatkan benang-benang atau semacamnya pada jendela-jendela untuk mendapatkan berkah. Sedangkan keberkahan hanyalah terdapat dalam hal-hal yang disyariatkan oleh Allah dan Rasul-Nya shallallahu 'alaihi wa sallam  bukan dalam bid’ah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Pergi ke gua-gua di Gunung Uhud, begitu juga ke Gua Hira dan Gua Tsur di Mekkah, dan mengikatkan potongan-potongan kain di tempat-tempat itu, di samping membaca berbagai doa yang tak diperkenankan oleh Allah ta’ala, serta bersusah payah untuk melakukan hal-hal tersebut. Kesemuanya itu adalah bid’ah, tak ada dasarnya sama sekali dalam syariat Islam yang suci ini.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": null,
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": "Menziarahi beberapa tempat yang dianggapnya sebagai bekas peninggalan Rasulullah shallallahu 'alaihi wa sallam, seperti tempat mendekamnya unta Rasulullah shallallahu 'alaihi wa sallam, sumur khatam maupun sumur Utsman dan mengambil pasir dari tempat-tewmpat ini dengan mengharapkan berkah.",
                                        "post_text_id": null,
                                        "text": null,
                                        "translation_id": null
                                    }
                                ]
                            },
                            {
                                "type": "note",
                                "pre_text_id": "Memohon kepada orang-orang yang telah mati ketika berziarah ke pemakaman Baqi dan Syuhada Uhud, serta melemparkan uang ke pemakaman itu untuk mendekatkan diri dan mengharapkan berkah dari penghuninya. Ini adalah termasuk kesalahan besar bahkan termasuk perbuatan syirik yang terbesar menurut pendapat para ulama, berdasarkan kitabullah dan Sunnah Rasulullah shallallahu 'alaihi wa sallam. Karena sesungguhnya ibadah itu hanyalah ditujukan kepada Allah semata, tidak boleh sama sekali mengalihkan tujuan ibadah  selain kepada Allah, seperti dalam berdoa, menyembelih kurban, bernazar dan jenis ibadah lainnya, karena firman Allah ta’ala:",
                                "post_text_id": null,
                                "text": null,
                                "translation_id": null,
                                "pre_contents": [],
                                "contents": [
                                    {
                                        "pre_text_id": null,
                                        "post_text_id": null,
                                        "text": "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ",
                                        "translation_id": "Padahal mereka tidak diperintahkan kecuali supaya menyembah Allah dengan memurnikan keta’atan kepada-Nya dalam (menjalankan) agama. (Al Bayyinah: 5)"
                                    },
                                    {
                                        "pre_text_id": null,
                                        "post_text_id": null,
                                        "text": "وَأَنَّ ٱلْمَسَٰجِدَ لِلَّهِ فَلَا تَدْعُوا۟ مَعَ ٱللَّهِ أَحَدًا",
                                        "translation_id": "Dan sesungguhnya masjid-masjid itu adalah milik Allah. Maka janganlah kamu meyembah seseorangpun di samping menyembah Allah. (Al-Jin: 18)"
                                    }
                                ]
                            }
                        ],
                        "pre_contents": [],
                        "contents": []
                    }
                ],
                "pre_contents": [],
                "contents": []
            }
        ]
    }
]